{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "_A840qMxhwGXEFaKYOPU_Q", "review_id": "62It4zZBW_hcUaVfWkgdjA", "stars": 5, "date": "2007-12-03", "text": "Krispy Creme? Grocery store cakes?  Git ahta tahn.... when it comes to donuts, pastries, and cakes they don't hold a wisk to Lincoln Bakery in Bellevue (or most Western PA bakeries for that matter).  Their cakes hit the top of my list (with Edy's downtown coming in second).  The batter is light and moist while the icing is smooth -- not too sweet - not too 'lardy'.  By all means, feel free to give them a decorating challenge as their peeps got mad skillz.\n\nIn my experience, Pittsburgh natives don't seem to realize how good their sweet tooths have it here, till they move away.  So, when I travel westward for the holidays I bring some Lincoln Bakery sweets along.\n\nI highly recommend their Burnt Almond Torte with either custard or lemon filling for nearly any occasion.  I get these for corporate gatherings often and they always go over well - and you know what they say about trying to please everyone!\n\nI'd suggest giving them a few days to a weeks notice as they keep pretty busy.\n\n(As a side note: though I rave about their donuts, pastries, and cakes.... for cookies I'd recommend Moi's Italian Bakery in Monroeville).", "type": "review", "business_id": "7wT532x2Qz5Hw9BqtBapqw"}
{"votes": {"funny": 4, "useful": 3, "cool": 2}, "user_id": "_A840qMxhwGXEFaKYOPU_Q", "review_id": "TcN_j4tBoRKDd16Xmv-W8Q", "stars": 2, "date": "2007-12-03", "text": "The home-cooked breakfasts at The Rusty Nail in Bellevue are wonderful, prices are reasonable, the wait staff are gems, and is often bragged about by Bellevue locals.  That said, two stars is all I can muster primarily due to the tiny, cramped dining area.  I've witness people at three tables being disrupted while they are eating so departing diners would have enough room to push their chair away from the table and pass by others just to leave.\n\nDon't get me wrong, I adore that Pittsburgh is a small, friendly city, but I'm not fond of getting elbowed in the back as the guy behind me cuts his breakfast steak and eggs, nor knowing his guest gargled with Cool Mint Listerine this morning (or worse, didn't) .  Yes, the tables are packed THAT close together.  And whatever you do, don't dare bring a large friend here to dine when it's busy unless you enjoy feeling like a complete 'jag off' for doing so on the way out.", "type": "review", "business_id": "ucKQlQvOeJxETLNkpKcaSw"}
{"votes": {"funny": 3, "useful": 1, "cool": 1}, "user_id": "_A840qMxhwGXEFaKYOPU_Q", "review_id": "ggobhUXXbcXxeAYzdYIQ_g", "stars": 3, "date": "2007-12-04", "text": "(Dreidel bagel song?)\n\nI love a softwich bagel,\nbaked with Asiago,\nAnd when it's cool and ready,\na supreme club I will swallow.\nOh, Bruegger's love your bagels,\nespecially on the go.\nI've just got 30 minutes,\nthen back to the office I must go.\n\n\nUm, yeah, so what if it doesn't rhyme, keep with the beat, and is lame.  The Supreme Club with cheddar and red peppers on an Asiago softwich slathered in honey mustard rocks, even if I don't. :)", "type": "review", "business_id": "qCg90xkk0VgdNF6IirZEPA"}
{"votes": {"funny": 1, "useful": 2, "cool": 3}, "user_id": "_A840qMxhwGXEFaKYOPU_Q", "review_id": "KbtSDINVZJ-_WslRHNHzGw", "stars": 5, "date": "2007-12-02", "text": "You simply can't beat the view of Pittsburgh's Golden Triangle (city skyline where the three rivers meet) from the observation platform at the top of Mt. Washington and the best way to get there is the Duquesne Incline.\n\nPark for free at the station near the base of the Incline across from West Carson Street (a hop skip and jump from Station Square and the Monongahela Incline) and enjoy a slow cruise to the top of Mt. Washington.  You'll be able to see the northshore stadiums, Point State Park, many of the bridges downtown is known for, and more.\n\nIf you can make it there on a warm, clear night with someone special to canoodle with, by all means do so.  Plenty of romantic dining in the immediate area with spectacular views of their own. *swoon*", "type": "review", "business_id": "gNiqOjhVCcGTniZWDBTYtA"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "_A840qMxhwGXEFaKYOPU_Q", "review_id": "fR5PoqC9o28pgjodnJNYRg", "stars": 4, "date": "2007-12-03", "text": "The Grand Concourse is a Pittsburgh landmark (located on the south shore near Station Square) and the largest restaurant in town with seating for approximately 500 guests.  This majestic former train station boasts old world architecture, decor, and photos to enjoy and is great place to take out of town guests.\n\nSeating in the main dining room or a table near the riverside windows (IMHO) are choice if you can get them.  On the riverside during the day you can enjoy watching the steamboats roll by and in the evening a nice view of the south shore city lights.  For Sunday Brunch if you can get seating outside the main hall you'll be happier as this is were all the food stations (and people waiting in line for them) are set up. \n\nI love their Sunday Brunch, though it can get a little hectic. They provide a variety of breakfast and lunch items including pancakes, omelets,  waffles made to order, freshly cut roast beef, chicken, pasta, fruit and more.  Get as much or as little of anything as you like.\n\nBy all means make reservations!  You might also want to check out Station Square's website to see what events are going on in the immediate area before deciding on a date / time as this will affect parking and/or making your visit more enjoyable if you can catch an event before/after you dine.\n\nI recommend their omelets or bananas foster waffles or bananas foster waffles or bananas foster waffles. ;)", "type": "review", "business_id": "vtcEXiQukuSzOMxyVxlh-Q"}
{"votes": {"funny": 1, "useful": 5, "cool": 2}, "user_id": "_A840qMxhwGXEFaKYOPU_Q", "review_id": "l5Z7JM3qrRB0vvzIkYFkTA", "stars": 5, "date": "2007-12-03", "text": "'All rise' for this Pittsburgh original and 'be seated' for some of the best Italian continental fare in town.  If the name doesn't give it away, The Common Plea tips it's hat to the neighboring county courthouse with some courtroom style decor, dark woods, brass accents, legal legend photos, etc.  It has a private club, low key, elegant dining vibe.  Expect suits for lunch (judges, attorneys and the like) and glitz for dinner (though you'll be fine in business/upscale casual).\n\nIt's expensive, but worth it if you love pasta, seafood, and wine (their list is excellent) and you'll definitely want to make reservations for dinner.", "type": "review", "business_id": "mbSIq0yerQhEUEFBB4pVGQ"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "_A840qMxhwGXEFaKYOPU_Q", "review_id": "Jd11qug1W7FJUI2XSPQX-Q", "stars": 5, "date": "2007-12-02", "text": "It's only fair to mention up front that I used to work at Benkovitz once upon a time.  (Ah, those were the days... serving Hall of Fame greats like Franco Harris; cleaning lobster tanks; learning what a \"milker\" was and that some folks actually buy these headless female fish with the 'guts' intact on purpose; calamari salad with tiny tentacle garnishes; running an errand on the way home only to have people 100 feet away hold their noses in disgust as the heavy scent of fish-house wafted in my wake.  To this day some folks still affectionately know me as 'Fish' (instead of Trish), but I digress. ;)\n\nBenkovitz is hands down the best place to pick up quality frozen, fresh, and prepared seafood and sauces.  It's a small joint in The Strip District and can get a little crowded, but worth the trek even if only for a fried or broiled fish sandwich and a fresh prepared seafood salad.  There is no seating indoors so get yours to go or expect to eat standing up at the small rails along the storefront window provided for this purpose.", "type": "review", "business_id": "rQCQsKxkqfVTYU9wgzhVSQ"}
{"votes": {"funny": 1, "useful": 4, "cool": 3}, "user_id": "_A840qMxhwGXEFaKYOPU_Q", "review_id": "zGMcyJsdVtQnrxycKqWnlQ", "stars": 5, "date": "2007-11-29", "text": "Every city has a few \"must see's\" and for Pittsburgh the Andy Warhol museum is one of them.  Whether you're entertaining out of town guests with an hour to kill or hosting a corporate function for the evening, the seven floors of this former warehouse are packed with something for everyone.  \n\nI've had the pleasure of attending casually with family on a lazy afternoon, as well as, several private elegant evening affairs.  The staff is always accessible and informative.  On an average visit I'd fore go the cafe and plan to eat before or after your tour (try Atria's or Outback at PNC Park, Finnigan's Wake, Isabella's Street Cafe, or Firewater's Saloon).  Nearby parking goes quickly on big event nights (Go Steelers! Go Bucs!), but it's well worth a stroll through the North Shore for a gander at Andy's eccentric life and eclectic collection of art and memorabilia.\n\nAs with most visitors the cloud room (floating silver pillows bouncing about the room) was most memorable.  As was the equally unique souvenir shop (remember the \"Billy's Parcel Service (BPS)\" doll that upset UPS so much?).\n\nAnd don't forget to bring your camera.... in addition to myriad of eye candy the Warhol has to offer, the looks on some tourists faces while perusing the many 'artsy' photos are absolutely priceless.", "type": "review", "business_id": "TRLMm_deLvlPNmGNqRxcow"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "_A840qMxhwGXEFaKYOPU_Q", "review_id": "CArkO1l2Nuhn806wTMc3BQ", "stars": 3, "date": "2007-12-02", "text": "Stacked tall and wide with your choice meat/fish/poutry along with their signature coleslaw, tomatoes, fries (yes, fries in the sandwich), & cheese, & cheese, & cheese (when you see the menu you'll get the joke) they are not particularly attractive, definitely not healthy, and no easy feat for a dainty gal to wrap her lips around. ;)  But, they are to da 'Burgh what Cheese Steaks are to Philly so if you find yourself in Pittsburgh you ought to stop by Primanti Brothers for one of their 'almost famous' sandwiches, if only to say you had one.  (Especially if you have post East Carson Street pub crawl munchies.  Their South Side location is open till 2am).\n\nYou'll want to handle one of these quickly - they tend to go a little limp as the bread and fries get soggy from the slaw.  Generally speaking, they are a bit much for me between the bread and fries.  Not to mention, I prefer my sides on the side, but to do so at Primanti Brothers - it just ain't right.", "type": "review", "business_id": "Q4ULAiIE2qCA4RYplCTrUQ"}
{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "_A840qMxhwGXEFaKYOPU_Q", "review_id": "R1VDw7zu4Q5hbz32SZc1cw", "stars": 5, "date": "2007-12-04", "text": "Whether your a baseball buff or not, if you are ever fortunate enough to be able to watch the Bucs via one of PNC Park's luxury suites GO GO GO!  The views of the field and the cityscape are spectacular.  The amenities are, well, luxurious.  The outdoor seating gallery is perfect for the hardcore Buc fans to watch the game and the adjoining suite with large picture window is perfect for mingling with co-workers or clients and grabbing some catered munchies.  There was even an a la carte dessert cart strolling the halls, when I was there, for those that hadn't included this in their catering orders.\n\nLots of other dining options in the park itself including The Home Plate Club (for those with club tickets), Vincent's Pizza, Atria's Restaurant, Seattle's Best Coffee, Ben and Jerry's, and of course..... 'Outback in the Outfield' which has plenty of indoor seating overlooking the field, as well as, a party deck with a view of both the field and the cityscape.  These restaurants are open throughout the week and frequented by business crowds for lunch.\n\nDid I mention the spectacular cityscape views from every seat in the park?  I really hated to see Three Rivers Stadium go (and was present when it was finally brought down), but have to admit the views from the new stadiums are breathtaking.\n\n(And, if you get to bring a guest, bring one that has the class not to salivate on the glass dividers of the outdoor gallery when they spot their favorite celeb or sports legend in a neighboring suite. ;)", "type": "review", "business_id": "9ylfrWjdX6CltGs_Qcv7Ng"}
{"votes": {"funny": 1, "useful": 6, "cool": 3}, "user_id": "_A840qMxhwGXEFaKYOPU_Q", "review_id": "jEw2injN_gewp8gDO9wShg", "stars": 3, "date": "2008-01-25", "text": "As with most things, Burgh is a bit behind the times, and I'm even farther behind. ;)  But, I've finally discovered cupcakes in Squirrel Hill at Dozen!\n\nIt's a cozy little joint with lots of artful little confections like 'The Cosmo' (vanilla cake, lime buttercream, topped with vodka and lime soaked cranberries) which, along with a cup of their tea or coffee, make for a sweet break from your daily errands. \n\nThey also have a catering service.  For a birthday or office party I think these would make for a nice, trendy offering as they look great, are easy to serve, and taste good.  However, for a truly special occasion such as a wedding, I don't think they hold a candle to the wonderful cakes you can get at a variety of established local bakeries (such Lincoln Bakery in Bellevue) and would be well advised to sticking with tradition.\n\nBe sure to check their alternating daily menu online and drop by to snag a few to take home and share the love.  Mmmmmmmm", "type": "review", "business_id": "AyIIESr_7vxrGcfKuYHNcA"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "_A840qMxhwGXEFaKYOPU_Q", "review_id": "WHuZndxgJgFtu5QPgcRgnw", "stars": 4, "date": "2007-12-02", "text": "Of the three Cheesecake Factory's I've been to, including Vegas, this one is my favorite.  Nestled in the heart of South Side Works it's a great place to stop while shopping, seeing a movie at the cinema across the street, a free outdoor evening concert in 'Town Square' out front, or for a special Sunday brunch.\n\nValet parking makes dropping by for just the restaurant convenient, though for a longer shopping excursion you might opt for the SSW garage within strolling distance on a nice day.\n\nThe interior is a tad more grandiose than the other two locations I've been to and its this scale that, IMHO, makes the venue seem a little less chaotic even when the cue is flowing out the doors.\n\nMy menu favorites: Avocado Eggroll appetizer, Grilled Shrimp & Bacon Club w/fries (I always wind up taking half of this home), and their absolutely divine Lemoncello Cream Torte.\n\nSorry, with Lemoncello Cream Torte on the menu who needs sex, er um, cheesecake, but if you must - the Banana Cream or Key Lime cheesecakes are sure to curl your toes. ;)", "type": "review", "business_id": "YeiH-kbGrwmIJlauSP_-dA"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "_A840qMxhwGXEFaKYOPU_Q", "review_id": "qkFCh1R4p_cVpHZwPApSeA", "stars": 3, "date": "2007-12-01", "text": "I had occasion to dine at McCormick & Schmick's during a trip to South Side Works.  Their location is convenient to SSW foot traffic and the combination of seemly tasty (though pricey) offerings displayed on the menus mounted outdoors along with the \"OMG - something new and modern here in the 'Burgh!\" factor was the initial draw of our small party.\n\nOnce inside we were hustled through a mosh pit style crowd surrounding the bar (I guess we're all desperate for something new in Pittsburgh) to a tiny bar table as the only available seating.  After our first round of drinks we were advised the actual wait for a table in the dining area would be considerably longer than initially expected.  Despite our cramped seating and jostling of the fuddled crowd we ordered another round and forged ahead dining were we sat.  Between the ambient chatter of the crowd and loud music we could barely hear ourselves think let alone comfortably speak with one another .  My sisters new fiance (eager to make a good impression on his future mother-in-law), made it clear to the waitress upfront that he would be taking care of our bill for the evening, but in true Rodney 'No Respect' Dangerfield style was consistently ignored throughout the evening, we were served incorrect drinks several times, the appetizers ordered were never brought out (yet were included on the bill), his dinner order was presented incorrectly twice... I could go on.\n\nOn some level it was comical how many things were going wrong and all we could do was laugh - as the saying goes 'doody happens'.  Admittedly, the wait staff was pleasant and appropriately apologetic.  The restaurant was beautiful inside (though not particularly unique) with lots of warm wood, white linens, soft lighting, and golden accents. The mark up on a glass of wine was ridiculous (you could buy a bottle for what they charge you for a glass in some cases), but the food was good.\n\nI'll give them the benefit of the doubt on the service - perhaps they were just getting off to a rough start.  I'm sure we'd have had a different experience on the dining side of the restaurant had we waited for a table or made reservations, but I haven't felt inclined to return.  Our group consensus was that the price paid in money and aggravation wasn't worth that two hours of our lives.", "type": "review", "business_id": "5japW20yvS1tomuvliRbcA"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "_A840qMxhwGXEFaKYOPU_Q", "review_id": "BBUSwcqZeu1ZAF0_BNIh1w", "stars": 4, "date": "2007-12-04", "text": "If you're looking for a swanky place to lounge before or after your theater trysts, consider popping by The Backstage Bar at Theater Square (across from Heinz Hall on Penn Ave) in the heart of Pittsburgh's Cultural District.  These folks keep things moving along (since most patrons have show times to make), and the food (from Cafe Zao) is delicious.  Although the live entertainment is free (no cover) expect to dish out a tad more than usual for anything you put to your lips.\n\nWeekdays it is also a decent place to stop for Happy Hour with your office posse.\n\nYou might want to check their website for entertainment schedules and current menu when making your theater plans.", "type": "review", "business_id": "4WiL3UaXCxj4lbWwsckisg"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "_A840qMxhwGXEFaKYOPU_Q", "review_id": "YrP7TYJVlRsNuTk2C5QV-Q", "stars": 3, "date": "2007-12-08", "text": "It's good for a gal's soul to get dolled up every so often and if you're a jeans and cotton T kind of gal looking for a place to spiffy up your wardrobe you might want to stop by Chick Clothing Boutique downtown (or ChickDowntown.com).  They offer a collection of contemporary designer frilly's and baubles to dress you from lobes to soles and every curve in between.  Speaking of curves - if you have trouble getting the right size in a department store you'll definately want to stop by to try things on rather than shopping online.\n\nI don't consider 3/5 stars a bad rating, but I do wish they had a larger more diverse selection (but then it wouldn't be a boutique) and I prefer not to shop downtown if I can avoid it.\n\nAdd to my Christmas wish list 1 Julie Brown Tatum \"Pink Waves\" Dress.  Too cuuuuuuuuute.", "type": "review", "business_id": "jup_vxxNC-XEAFOX2uuc9w"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "_A840qMxhwGXEFaKYOPU_Q", "review_id": "1SBvU1vXkYaZepnFze9aUw", "stars": 5, "date": "2007-12-08", "text": "A candy store for the gals that used to like to get into mom's stash of goodies...\n\nUlta, IMHO, rivals many department store beauty & fragrance section.\n\n\n*  Hundreds of top quality, trendy, and colorful polishes, lipsticks, eye shadows, blushes galore all lined up like a big box of crayons for your face and nails.\n\n*  Rows of all the latest designer fragrances.\n\n*  All the hair care, skin care, and bath products you can shake a loofah back massager at.\n\n*  You can even pick up some manly scents, shaving and skin care essentials to keep your hunk looking dapper.\n\nThough it may be a little out of the way if your travelling from north of downtown, the location at Waterworks in Homestead is large and near plenty of additional trendy stores for the girl with shopping fever.\n\nThey are consistantly running special deals on various products, and if you join the rewards program every dollar you spend will earn you discounts towards future purchases and/or free gifts.\n\nWhat's not to love?", "type": "review", "business_id": "9C5rKkDQsghpQKyBqPtKFw"}
