{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UTS9XcT14H2ZscRIf0MYHQ", "review_id": "DGey4yBCKjIB2IdwzTA9Jw", "stars": 3, "date": "2007-04-29", "text": "I understand a burger joint probably is likely not going to cater very well to a vegan, but the guys at work wanted to go. I had a Boca burger which was quite plain. Nothing special. The waitress worked hard to make sure the food I got was vegan so that is why the rating is so high comparatively to the rest of the experience.\n\nIf you do eat meat you'll likely have a completely different impression of the place.", "type": "review", "business_id": "4qHd6e7kAL9dszYrQUkjLg"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "UTS9XcT14H2ZscRIf0MYHQ", "review_id": "ZWYnFWY39ZyyWfX6Y7GeHA", "stars": 3, "date": "2009-09-06", "text": "So a few of us are at First Friday in downtown and decide to have some after party action. We aren't sure what's close enough in walking distance and two of us immediately go, \"Let's Yelp it\" (yay, for Yelp on the iPhone!).\n\nWe wanted to go to a bit of a dive bar and Dino's popped up, had four stars, and was a couple of blocks away. \"Ding ding ding, we have a winner!\" Or so I thought.\n\nWhen we walked in, it certainly had the look of a dive bar, down to the busted plastic divider that holds the pool balls after they've been sunk such that you don't actually have to put money into the table to play. The problem was that the mood and the atmosphere just were not there. I've been to some pretty interesting dive bars. Ones where the owner's dogs loll about looking for a good scratch behind the ear, or where you find an eclectic mix of people and start up a conversation with a person carrying their As Seen On TV birthday gift around with them. Dino's is not that kind of place. At least it wasn't when I visited. Dino's isn't a bad place, but it's not a great place either. It's just a run of the mill dive bar.", "type": "review", "business_id": "_9BqmRowpWfy4wDPXLSDHA"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "UTS9XcT14H2ZscRIf0MYHQ", "review_id": "q23EyPyZhCrZPjS_6oXh2A", "stars": 5, "date": "2013-04-01", "text": "I can't believe I've been in Vegas as long as I have and that I only recently had a western. It was amazing! Great end to the night. The nuts totally hit the spot and the peanut butter custard I had was just so creamy. I can't believe the size of it too. I got the junior and I had trouble finishing it. Maybe next time I'll forgo dinner and just have a regular size custard instead!", "type": "review", "business_id": "uYVdp5LfCbX8S8ytnhdk-g"}
{"votes": {"funny": 1, "useful": 3, "cool": 0}, "user_id": "UTS9XcT14H2ZscRIf0MYHQ", "review_id": "6B5HwI5_EMA3k7Eu7LGdow", "stars": 5, "date": "2014-03-17", "text": "I have no idea why there are so few reviews for this place. It's awesome! We came to the strip mall to eat at Tokyo Japanese restaurant, but it was closed. So we sauntered over to Lotus of Siam and they had a 2 hour wait. We then decided to see what the wait was like at Komol and it was merely half an hour, but we wanted to eat sooner rather than later. One of the guys in our group saw this place and my girlfriend was like \"What does Yelp say?\" So I looked it up and it was five stars, but only three reviews and the last one from 2012. We decided to try our luck and I have to say it was well worth it!\n\nIf you like Korean food you should definitely give this place a try!", "type": "review", "business_id": "YkRwenPlQRloPFOX5l-iEA"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "UTS9XcT14H2ZscRIf0MYHQ", "review_id": "BmE8wNyWBkVS513uVGPVEQ", "stars": 1, "date": "2013-04-01", "text": "I'm very confused about the glowing reviews for this place. My experience here was terrible. So I come around 7:30pm on a Thursday night to get some southern soul food like I remember from my childhood. After all I grew up all over the south including Louisiana, Georgia, and South Carolina.\n\nSo I go to the back where the prepared food is and there are two people in front of me. I figure there should be no problem getting some food and being out of there in time to pick my girlfriend up from yoga at 8pm. The line is moving at a snails pace and 10 minutes in I'm starting to worry. I really want to try this famed fried catfish I've read in these reviews. Around 20 minutes in I finally get to place my order for some catfish and fried okra (it's been forever since I've had some and I love it). I end up waiting a total time of nearly an hour and give up on the okra because somehow that was forgotten from my huge order of... two items. So I figured I'll just grab some macaroni salad that they had pre made and head out since I was supposed to pick my girlfriend up nearly half an hour ago.\n\nSo we finally sit down to eat the food I brought back hoping that it makes up for the wait. I figure it might have been an off night, but if the food's tasty I'm willing to give it a pass. No such luck! The catfish is terrible. It's most definitely frozen catfish that they have tried to mask the flavor and texture of with the breading to no avail. The macaroni salad tastes like they thought it was supposed to be a dessert, so they piled on the sugar.", "type": "review", "business_id": "b6qYCOz0vzJW4U81XLY8IA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UTS9XcT14H2ZscRIf0MYHQ", "review_id": "_icJ2KXXzGDgHljQ0YeW7A", "stars": 4, "date": "2012-09-30", "text": "I have to say, I was pleasantly surprised when I dropped in here. I just moved to this part of town from Summerlin and had not finished unpacking yet. I decided to try to find something decent in the area to eat. Thanks for the help Yelp!\n\nSo I walk into the restaurant on a Monday night and it is pretty dead. I decide to take a look at the menu for some take out. The girl at the front was pleasant.\n\nI ordered the Raw Salmon or Raw Shrimp in Spicy Fish Sauce (#94). The girl at the front checked with the chef and mentioned the salmon was not fresh, but the shrimp was. So I ended up getting the shrimp though I was more looking forward to salmon. Anyway, she then asked how spicy I wanted it from 1-10. Being used to most of the other Thai restaurants in the area I knew even a 10 would be weak sauce. Boy was I happily wrong. The dish was probably around a 9 on the spicy scale for me, and I loved it!\n\nAs for the actual flavors of the dish, they went together beautifully. Raw shrimp, with large chunks of garlic, lime, and mint with a healthy dose of minced chilies was heavenly. I definitely felt the pain by the end of the meal which was actually quite large. Bigger than I was expecting.\n\nI'll definitely give this place another try, especially because I saw a sign that says they deliver!", "type": "review", "business_id": "QXTN5WwZxvf-Z940RmDUdQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "UTS9XcT14H2ZscRIf0MYHQ", "review_id": "7Ykc53Fm1Goa0pVs_5EINA", "stars": 3, "date": "2012-12-08", "text": "Typical bar food type place that is good for large gatherings. They are accommodating, have a fairly large place, and it has never been too busy when we went for an after work get together.\n\nRoadrunner Saloon is nothing special, but it's not bad either.", "type": "review", "business_id": "jsO9c15l1KJ5ncBid3pnmA"}
{"votes": {"funny": 1, "useful": 1, "cool": 2}, "user_id": "UTS9XcT14H2ZscRIf0MYHQ", "review_id": "pRITFax9HlQlR8rIbuz6Pw", "stars": 4, "date": "2007-04-29", "text": "I'm pretty much only going to review their beer selection because that is all that concerns me. Lee's has a decent selection. It's the best I have seen so far here in Las Vegas. I have seen stores with better selections in places like Chicago, but if you are a beer connoisseur then this might be the best you can find in the area. Also, they provide a discount if you pay with cash (debit cards count as cash as well), so you can get some pretty good deals.\n\nThere is a Lee's closer to where I live, but this one is close to work so I occasionally  just pick something up on the way home. And no I'm not an alcoholic, I just enjoy fine beers.", "type": "review", "business_id": "GSwbLWgYUEmybLrNJBLd2g"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "UTS9XcT14H2ZscRIf0MYHQ", "review_id": "bRq82GEwlOJImw2TlymRoQ", "stars": 1, "date": "2007-04-29", "text": "It's a quick meal for lunch, but fairly unappetizing. I am quite unsure why there was such a long line leading to the entrance. It's place I am definitely not look forward to visiting again.", "type": "review", "business_id": "8FPi95ZuJHF30N-einyEmw"}
{"votes": {"funny": 1, "useful": 3, "cool": 0}, "user_id": "UTS9XcT14H2ZscRIf0MYHQ", "review_id": "lcI1QSeXaTSb209vvzOaDg", "stars": 1, "date": "2009-07-25", "text": "I feel weird giving this place such a low review considering how many good reviews this place has received. Maybe I'm just a bit pickier than most, or it could be that there was only one item on the menu I could eat and it turned out to be a greasy mess. Unfortunately it wasn't pho either since all of their pho is beef or chicken based.\n\nIt was probably my mistake for expecting to find vegetarian pho, which I've had in all the pho restaurants I've been in from Texas to California. I guess Nevada is the exception, despite the wide variety of vegetarian cuisine in Vietnam thanks to a large Buddhist population.\n\nMy review is probably only useful for those who are vegan/vegetarian. For all others you can probably safely ignore anything I have to say about the food here.", "type": "review", "business_id": "33aOj9haiHsULCUmFOZ7uQ"}
{"votes": {"funny": 1, "useful": 3, "cool": 0}, "user_id": "UTS9XcT14H2ZscRIf0MYHQ", "review_id": "M2nh7i1IkMpcz3_opQzKVw", "stars": 4, "date": "2008-10-04", "text": "I am torn between a four and a five star review. I have eaten at Go Raw Cafe a couple of times. The first time with my folks, which kind of soured the experience for me since they were continually criticizing of everything (which they do in general regarding my being vegan). The food I had the first time I went was pretty good, though I got one of the veggie juice drinks and I just could not stomach it. As surprising as it is, my mom the ultra nag ended up drinking it!\n\nFast forward over a year. I just got back from Go Raw Cafe and I had the \"Cheese burger\". The burger was HUGE. It came on a well decorated plate with the burger on one \"bun\" and the toppings on the other. I started to eat the two separately but one of the ladies at the restaurant urged me to put the burger together, mash it all down, and go ahead and make a mess. Well, I did and I have to say the burger was amazing and very filling.\n\nI will definitely be going back to sample more of their dishes. Who knows maybe I'll end up changing the review to five stars!", "type": "review", "business_id": "8Eh-lPCEXfGP72gQTct-lw"}
{"votes": {"funny": 0, "useful": 5, "cool": 0}, "user_id": "UTS9XcT14H2ZscRIf0MYHQ", "review_id": "zb2WFRZHOVZmP_2UVw09vg", "stars": 5, "date": "2009-11-05", "text": "Having recently been burned by overpriced terrible tasting food at another Indian restaurant in the area *cough* Bollywood *cough* we were hesitant to try more Indian cuisine. We were having a tough time coming up with a new place to visit so I went to Yelp. I started looking up various ethnic cuisines and I did a search for Nepalese food. Much to my surprise a place called Mint Indian Bistro showed up. After reading the reviews it seemed like the place had a mix of Himalayan and Northern Indian cuisine. So we made a resolution, we'll try some appetizers and if we didn't like it we would go to a different restaurant for our main meal.\n\nAll that plan B contingency stuff went out the window when I looked at the menu. They actually had menu items marked as vegan and vegetarian such that for once I would not have to ask about the ingredients they use in each of the dishes. So we made the plunge. We decided to share the Vegan Sampler and it was good. I want to say it was great, but there were a couple of items in the sampler that I did not enjoy as much as the rest.\n\nAdditionally the decor and feel of the restaurant was very nice. They even turned the lights up for us temporarily while we were perusing the menu so my mother could see the menus as she squinted without her reading glasses again.\n\nWith full disclosure and all that jazz I would say the food was in the four star range, but the addition of the vegan friendly menu really pushes the rating up for me into the five star range. I gotta help promote any vegan friendly place here in Vegas because they are not as prevalent as they are in other towns.", "type": "review", "business_id": "gkWEjZIVcrUerEzed6IKpg"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "UTS9XcT14H2ZscRIf0MYHQ", "review_id": "D9SsYEAUV9rVsmfW3ktW6w", "stars": 4, "date": "2012-12-08", "text": "I went here for my 30th birthday and it was well worth it.\n\nI got reservations for a Friday night at 6pm. When we went in they had a table for us, but my girlfriend wanted to sit outside. They were very accommodating and brought us out to a large table on the patio overlooking the water. When we first sat down, there were some pine needles and a bit of debris on the table. They cleaned it off and I did not think much of it, until later when we discovered why they were on the table. We were sitting under a pine tree, and when the wind blew it was dropping bits and pieces on the table! The waiter feigned ignorance as if he had never seen that happen before, but it detracted from an otherwise stellar meal.\n\nSo we took our time in deciding which of the three available courses we wanted. There was a prix fixe menu that my girlfriend ended up choosing and the degustation menu I decided on. I mentioned that I was pescatarian and the waiter said it was no problem making substitutions as need be, so I ended up substituting the foie gras dish for a shrimp dish from the prix fixe menu. I also decided to do the wine pairing for the degustation menu.\n\nI have to say that all the food I had was exquisite. Each course had a wide variety of flavors, that blended together so well that I felt my palate was going on a ride. The various courses covered different sensations on my tongue as well, from creamy, to crispy, and nearly everything in between. It was all so rich and flavorful. All but one of the wine pairings seemed spot on.\n\nMy girlfriend enjoyed her meal as well, except for her main course of the roasted pigeon. She took one taste and decided it just was not for her. Fortunately when she took it home for the doggies, they LOVED it!\n\nThe experience was really 4.5 stars and I'm sure it could have been 5 stars with a few tweaks. The $400 I spent for the evening was more than worth it.", "type": "review", "business_id": "-5RN56jH78MV2oquLV_G8g"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "UTS9XcT14H2ZscRIf0MYHQ", "review_id": "N-yAlbBZPEs9o4axG6JP-Q", "stars": 2, "date": "2014-12-19", "text": "If not for the ambiance which was laid back and the wait staff who were very friendly this would be a one star review. Food was bleh. First the coffee was terrible. I took one sip and left it. For a place with coffee in the name I was very disappointed. Most diners have reasonable coffee, not this place.\n\nThen when it came to the food it was bland with nearly no flavor. Not sure why there are so many reviews praising the food. Be warned.", "type": "review", "business_id": "Ymbxezwhkf8-8sDWUWOScQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "UTS9XcT14H2ZscRIf0MYHQ", "review_id": "x6gcKK3dgv1Pac47ZSD-tg", "stars": 2, "date": "2010-01-17", "text": "There is only one bartender working. If it's busy like when I visited then you are screwed if you want a drink.", "type": "review", "business_id": "KFj-E9_30TMy0Ryq3NBEHA"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "UTS9XcT14H2ZscRIf0MYHQ", "review_id": "n3NhOKW6mLjfNBn8pNbghg", "stars": 5, "date": "2009-11-05", "text": "Walking into the restaurant for lunch  I was immediately struck by the outdoor seating in the patio area. When we sat down our waiter came around and my first impression was that he was overly cavalier. As the meal went on he kind of grew on me, especially because having recently injured my shoulder my right arm was in a sling and he had the food pre-chopped such that I could eat it one-handed with ease. Now on to the food. \n\nI  ordered the mixed greens which tasted fresh and the dressing was light rather than overpowering as most dressings seem to be these days. It allowed the flavor of the various greens to shine through. Afterword for the main course I got the wild mushroom tamales. They were moist and fluffy. The seasonings were just perfect, and the jicama on the side really hit the spot. These were the best tamales I have ever had, though to be honest I am not a tamale connoisseur.\n\nAfter lunch we sat back with some tea and enjoyed the myriad of birds flying around and even attracted quite a few by feeding them a bit of scraps. All in all it was a very pleasant way to spend our time.", "type": "review", "business_id": "vEeiIvhzz29rO-6EPFqkjQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UTS9XcT14H2ZscRIf0MYHQ", "review_id": "rifICtAf3QeDLupHekQQ2A", "stars": 5, "date": "2007-04-29", "text": "I only tried one of the beers, their porter. It was decent, but it did not really stand out. The salad I ordered on the other hand was very good. It had candied pecans and a variety of greens. The wait staff was also excellent. Attentive, but you hardly noticed they were there.", "type": "review", "business_id": "zORdAIouXrGO1yU4sIMweg"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "UTS9XcT14H2ZscRIf0MYHQ", "review_id": "dgYehTx4Uy2_-3Es-MZCvg", "stars": 4, "date": "2007-06-14", "text": "This gym has become my mecca of fitness the past couple of months. The gym has lots of equipment and usually there is little to no wait on the equipment. Unfortunately, the previous gym I was a member of (Lifetime Fitness) spoiled me, so I cannot rightly give a five star review, especially because at LVAC all the machines are crammed in together, often with little space to maneuver. Considering that the monthly membership is half that of my previous gym, I think the value is well worth the price.\n\nLaura did such a great job of describing the gym that there is little else to mention. Though if you are like me and go straight from the gym to work in the morning, be warned that the showers in the men's locker room are just open stalls. The showers have better water pressure than my place so that makes up for it. In fact it's been at least a month since I've showered at my place since I go to the gym in the morning before I do anything else.", "type": "review", "business_id": "C7hN8QQUxC8uQk2YwiQ53A"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "UTS9XcT14H2ZscRIf0MYHQ", "review_id": "6dNCYFD0L0t3wgekWzPh5Q", "stars": 4, "date": "2009-08-09", "text": "The first time I walked in I knew it had to be pretty good because of the number of old Jewish ladies picking up bagels, challah, deli meats and cheeses for the week. Is it a coincidence that I gave them four stars and there were four old Jewish ladies in the store the first time I went in? I'll let you decide.\n\nOn to the actual bagels. They are pretty tasty, but the onion bagels turned out to be so-so because the onion on top was over cooked, i.e. a bit charred. Other than that I've been very happy with the quality of bagels this place has and I've been back quite a bit since.", "type": "review", "business_id": "eorZsn0R8dreYSq4qxeXig"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "UTS9XcT14H2ZscRIf0MYHQ", "review_id": "4kG4Z_SziuVPnsrXwQDDHg", "stars": 4, "date": "2007-09-30", "text": "There are very few vegetarian friendly sandwich shops out there, but Capriotti's is one of them. They have a handful of sandwiches made with faux meats. The sandwiches they make are also quite filling. Their small is a 9 inch sub, with a 12 inch, and an 20 inch sub rounding out the options.\n\nEdit: I was recently informed that the faux meats that Capriotti's has are NOT vegan. Sorry if my previous review led anyone astray.", "type": "review", "business_id": "WSn5MVSNpagFlRI_Z7lMGQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UTS9XcT14H2ZscRIf0MYHQ", "review_id": "7AOKcBjePvc8ByziJDc90Q", "stars": 2, "date": "2007-06-15", "text": "The Island theme for the restaurant is really in name only. As far as I can tell they do not have any real Island food, unless you can count burgers. They did have veggie patties (for those vegetarian/vegans out there), but it's nothing that you can't get at the frozen food section at the local supermarket. I have to say I was massively disappointed in the food, though the nice thing is BJ's Brewhouse is just a few short steps away and it has a much more varied selection of good food and beer. Save yourself and just hit that place up instead.", "type": "review", "business_id": "m7IEMSzrR8KPjCsLEqOobA"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "UTS9XcT14H2ZscRIf0MYHQ", "review_id": "2Au-9bwQaGO-OuPXHIBG4g", "stars": 3, "date": "2009-09-06", "text": "After going here for lunch I think Rose O.'s review is spot on. The food was in the 4-5 star range, but the service was in the 2 star range.\n\nOne day at lunch I noticed that some guys had come back from a new burger place because of the amazing looking sweet potatoes fries I saw them chomping on. I asked them where they got it and they said Create. I had seen the place open up a while back, but never stopped in to check it out. After \"sampling\" a few fries I decided I would look the place up. When I found out they had a couple of vegetarian dishes I was sold.\n\nThe next time I went out to lunch with a group from work we figured we would go here. There were a number of us going so we had to take several cars. I hit the gas so we could be the first in line, and first we were. Unfortunately we were the last to get our food and head back to work. That's where the 2 star service comes in. Apparently one of the cashiers made a mistake and had to ring the order up as pickup order.  So we sit around waiting for 20 minutes wondering where the food is and when we ask it was sitting in the kitchen the whole time!\n\nNormally I would give them the benefit of the doubt because mistakes sometimes happen, but after reading Rose O.'s review of the place I have a feeling that mistakes are a common occurrence rather than a one off affair.", "type": "review", "business_id": "nLn4yNELpgpWADSHdIcCsg"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "UTS9XcT14H2ZscRIf0MYHQ", "review_id": "X0IA2xQPAF4hcM3szEAtQA", "stars": 5, "date": "2008-09-28", "text": "It is a bit of a hole in the wall, but this place is AWESOME. I went with a date after checking out a review here on Yelp. I had high hopes and they were exceeded. It's not easy eating out with people while being vegan, but this place makes it effortless. Not only was my vegan chicken and spinach quesadilla amazing, but my date ordered the mac and cheese (non-vegan) and just loved it. She said it was the best mac and cheese she's had. We both liked it so much that we know we'll be back.\n\nI might even have to update this as I try more of their menu.", "type": "review", "business_id": "udGgvy4TYdsdv13j1UzOIg"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "UTS9XcT14H2ZscRIf0MYHQ", "review_id": "VzxyveW5q2CYCb9TjaYsoQ", "stars": 5, "date": "2009-07-22", "text": "I have to say that it had been a while since I visited Red Velvet Cafe. Since then they have gotten a lot busier and even expanded the restaurant to have enough space for all the patrons. I say good for them, it's about time!\n\nI just took a vegetarian friend to lunch there, which might have been a bit of a mistake since it was so busy. After we got our food and he took a bite he said he was going to put the restaurant into his regular lineup because he liked it so much.\n\nI have also brought my omnivore type friends to this place and they all love it. I have nothing but good to say about Red Velvet Cafe. And their vegan desserts are to die for.", "type": "review", "business_id": "udGgvy4TYdsdv13j1UzOIg"}
{"votes": {"funny": 2, "useful": 1, "cool": 0}, "user_id": "UTS9XcT14H2ZscRIf0MYHQ", "review_id": "JCzrxwiGYp7b_Di33ErwzQ", "stars": 2, "date": "2009-07-23", "text": "Axum happened to be my first real experience with Ethiopian food (previously I had it while going to school at an ethnic potluck dinner). I went here with a group of 8 - 10 people, one of which loved the place and was actually the one to suggest we go. When I walked it I immediately noticed that there was group of I am guessing Ethiopians sitting around the bar and no one else. The place did not look very prepared for serving restaurant patrons. So the menus come out and I guess since he had suggested the restaurant he decided to order for everyone, since he was familiar with the cuisine. I'm a little miffed at this point, but don't care enough to make a big deal about it. At least they ordered some vegetarian food.\n\nSo when the food comes out, they have these huge platters with injera, the traditional Ethiopian bread, on the bottom and the food on top. I enjoyed the experience of eating with my hands and sharing, but the food was not that great and the atmosphere totally sucked.\n\nWhen we had finished our meal, the waitress mentioned that the restaurant was under new management and handed us some business cards. I'm guessing the change of management could account for the discrepancy between Keith A's review and mine. Either that or I'm just a picky asshole. It's probably the later.", "type": "review", "business_id": "6Svv3pgeGt1c4BcngzQOWA"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "UTS9XcT14H2ZscRIf0MYHQ", "review_id": "EpAt02zbebCR1gg-508m7g", "stars": 1, "date": "2009-07-23", "text": "I really should have checked out the Yelp review for this place BEFORE I decided to visit it on a whim.\n\nI really wanted to like this place. My brother's wife's mother owns a restaurant called the Mad Greek, which is a fabulous place. I thought for sure, any place that shares the name would share the food and atmosphere. I guess I was mistaken.\n\nSo before I walk in I look at the sign to see if they were open. The sign was off, so I probably should have taken the hint and left, but I decided to go in anyway. I am greeted by a waiter, who is in the middle of taking someone's order, and who I cannot seem to understand. I just end up walking out to the patio area because it seemed like fresh air would be nice. Well fresh air mixed with smoke would have to do.\n\nSo a minute or two later, the waitress comes up and gives me the menu to look at and takes my drink order. When she comes back I immediately order an appetizer, the baba ganoush. She seems totally clueless as to what I just ordered and nearly yanks the menu out of my hands so she can take it with her because she needs it to remember the order. I know, WTF?\n\nThe baba ganoush comes nearly immediately. My guess is that they have it premade and just slap it on a dish and go. I tell the waitress that I need a minute to decide for my entree. It turns out that I need a minute equates to don't come and check on me for literally 20 minutes! In fact I don't see the waitress again until after my order comes back, so instead I end up flagging down the bus boy who luckily came out to clean up the table of the only other group that was out on the patio. \n\nI ask him to get the waitress, but he insists that he can take my order, in very broken English I can barely understand. I tell him my order and he is sounds confused. So I point to the two items on the menu. The guy still seems a little clueless, but walks off repeating the order to himself, only to return moments later. He has a pen, highlights menu items I ordered, and takes the menu with him. At this point I'm really unsure if I'll even be getting what I ordered if neither the waitress nor the bus boy can remember very simplistic orders.\n\nAfter all is said and done, the food was not very appetizing. I ate little but the baba ganoush (which was decent) and I ended up taking the okra home. I told the waitress not to box the soup that I hardly touched. So she asks, \"Didn't you like it?\" At that point I was kind of dumbfounded. Why else would I ask NOT to take it home. It was that atrocious. Do I have to spell it out?\n\nNow that I see the other reviews I don't feel so horrible giving this place one star. It seems there is a consensus on this place. I really need to get an iPhone already so I can check reviews before I make these bad dining decisions.", "type": "review", "business_id": "u0cuE27NIdXAil6i-scRGw"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "UTS9XcT14H2ZscRIf0MYHQ", "review_id": "kTHUrK2KPxBYSUgDrAwmvA", "stars": 2, "date": "2009-07-23", "text": "So I decided to try a new bagel place out and since I saw this while I was driving around last night, so I gave it a go this morning. The only thing I have to judge this place by is the bagel I picked up. The bagel is very meh. It is too doughy and chewy.\n\nIf I need a bagel in a pinch I might go here, but I rather go a little out of my way for a better bagel.", "type": "review", "business_id": "1XvPKxRJc0oIxQqFD7Hnvw"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "UTS9XcT14H2ZscRIf0MYHQ", "review_id": "WQG6lms8XF0z4lFjfU0gsA", "stars": 4, "date": "2012-12-17", "text": "When we first started the adventure I was trepidatious, but as the night continued the time flew by. By the end of the night everyone on the adventure was laughing and just having a great time. The host for the evening, Joe, was a great character and tried to keep everyone engaged. All in all I had a good time.", "type": "review", "business_id": "aGfDYYFFWDHas7ipbE5TMA"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "UTS9XcT14H2ZscRIf0MYHQ", "review_id": "GwsOMcwieJdSWaccC8LfvQ", "stars": 4, "date": "2009-07-21", "text": "I went in with two other guys and noticed that the name of the place is actually Fresh 'n Fast now. There were just a handful of people despite it being lunch time. I ended up ordering the black bean burger and a fruit cup. The place might have fresh food, but it certainly was not fast. The black bean burger was pretty tasty though. It was a little spicy, which was a nice twist.\n\nThe fruit cup included watermelon, cantaloupe, pineapple, and strawberries. All but the strawberries were good.", "type": "review", "business_id": "54EUU3wVNm8-GfYQp1cqkw"}
{"votes": {"funny": 0, "useful": 6, "cool": 2}, "user_id": "UTS9XcT14H2ZscRIf0MYHQ", "review_id": "rqpH629aWKcMkk72zPwtAg", "stars": 4, "date": "2009-11-05", "text": "My mom was in town for a convention (go figure!) and we were deciding on places to eat when my mother mentioned she had never tried Ethiopian cuisine before. Having tried a couple of Ethiopian restaurants in the area I decided to find something new on Yelp. Blue Nile seemed to have decent reviews.\n\nWe ordered the vegetarian combo. The food was definitely more than my mother and I could finish and it was all very tasty. From my visits to other Ethiopian places in Vegas like Axum, I can say this was definitely the best tasting Ethiopian food I have had in the area.\n\nAdditionally the wait staff was very friendly. When we came in we were the only people in the restaurant and they treated us very well. They patiently described all the dishes that my mother asked about and made us feel very welcome. In fact later on in the evening during our coffee ceremony some of the wait staff's family came in with some homemade bread they had made. They cut some of it up and offered it to us as well.\n\nThis would have been a five star review, but the ambience just wasn't there. Maybe it was because we came so late and no one else was in the restaurant. Regardless this is definitely a restaurant I will be visiting again.", "type": "review", "business_id": "RSBdMDQF1nYBj7NTUCdxHw"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "UTS9XcT14H2ZscRIf0MYHQ", "review_id": "jfpJpKvXM-2PJFRP62iYqg", "stars": 2, "date": "2009-07-21", "text": "I just noticed that this place had opened and did pulled a u-turn to go try it out in the hopes I might get another first review. Once I got in I was a little confused because I didn't realize it wasn't a sit down and order type place. Instead you go up to the counter place your order, take a seat, and your order comes out to you. So I start looking over the menu I see the familiar mediterranean fair, but I notice a difference. They make their hummus and baba ganoush with yogurt. Instant turn off.\n\nDespite this I decide to give the place a chance and I order a vegetable skewer and plato's potatoes. Turn's out plato's potatoes is just french fries with another name. I think ate two or three and gave up. The vegetable skewer was pretty decent and actually had a hunk of peach in it, which was a nice twist. Unfortunately that was not enough to make up for everything else.", "type": "review", "business_id": "wtD7EvFhxt8EeNODbl1G_A"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "UTS9XcT14H2ZscRIf0MYHQ", "review_id": "TbpLFPZWUmg4lxfoBumK1w", "stars": 1, "date": "2009-07-22", "text": "First I tried going to the Tropical Smoothie Cafe on Fort Apache. Despite it being 10 mins to closing time, they said they were already closed. Okay I could deal with that. So I drove around and found this Tropical Smoothie Cafe that had a 24 hour drive through window.\n\nI wasn't really sure that I wanted a smoothie, and maybe that was my mistake. So I decided to order one of their sandwiches. Big miscalculation. I ordered the Hummus Among Us. It is literally two slices of store bought bread, with store bought hummus, tomatoes, peppers and lettuce stuffed in between. For that amount of effort it shouldn't have taken more than a minute to make the thing, yet it did.", "type": "review", "business_id": "wLK4Ifw0XGlaeOD125PrEQ"}
{"votes": {"funny": 1, "useful": 5, "cool": 2}, "user_id": "UTS9XcT14H2ZscRIf0MYHQ", "review_id": "ilgSxlLQoYr3R47gTfsayA", "stars": 5, "date": "2012-12-08", "text": "The first time I ever got a wax (a brazilian at that) was here and I came back! No, I'm not a sadist, it's just that Marianne is a very warm and welcoming character and helps guide you through the process. She even helps distract you during some of the more sensitive areas.\n\nShe is very experienced with male brazilians and understands it's different for men than women. I'm a hairy arab, and she took it in stride. She seems to have experience with all kinds of body hair and she is meticulous to ensure she achieves the desired result.\n\nMarianne is also very professional and I could not recommend her more! If you are a guy thinking about getting a brazilian this is where you should go.", "type": "review", "business_id": "ygI6Q8ck2qf3Y0iCM2Lkag"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "UTS9XcT14H2ZscRIf0MYHQ", "review_id": "ymAykQ0pxNpqvajOlO5n-Q", "stars": 4, "date": "2013-04-01", "text": "I've been to Lola's at least twice now and I really enjoy the catfish po' boy! The atmosphere is nice with a bit of hussle and bussle. The second time I was there I sat in the outdoor seating area and they were doing a photo shoot for some of the food they have. Ended up getting some free oysters for appetizer before the meal. They were great and probably tasted even better because they were free :-). I definitely look forward to coming here again.", "type": "review", "business_id": "Lp-A-JNRUUH72uou5-pMtQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "UTS9XcT14H2ZscRIf0MYHQ", "review_id": "qGKg4tx729IXOTUF628lqQ", "stars": 5, "date": "2012-12-08", "text": "Hooray for french food in Summerlin! This place has the most amazing pastries and cakes! I can't stop buying them here. The cakes are a bit pricey, but more than worth it. The tarts are just heavenly. I have yet to get something I was not thoroughly happy I purchased.\n\nThey also make excellent breakfast and lunch food. Scrambled eggs and a croissant for breakfast really hit the spot, as does a nice goat cheese and mushroom quiche for lunch. Really you can't go wrong here. My only concern is that my metabolism can't keep up with all the rich tasting food!", "type": "review", "business_id": "Y2BXS2OOrlMSYfS5xdjtmw"}
{"votes": {"funny": 0, "useful": 4, "cool": 0}, "user_id": "UTS9XcT14H2ZscRIf0MYHQ", "review_id": "jur1cg-wTs6MR3lvhXj0Qw", "stars": 2, "date": "2013-04-01", "text": "I really like Red Velvet Cafe on Sahara and I've been going there for years now. Though, I have to say that this location is not ideal. I picked up a croissant sandwich to go and it was soggy and falling apart when I went to eat it. Luckily the tiramisu cupcake I got is just as good as the cupcakes they have at their other location. I really want to support this business and would give them a higher rating, but I feel the quality seems to suffer here. Hopefully in the future they'll work out the kinks and I'll gladly write an updated review!", "type": "review", "business_id": "USyDC-cZCexcyNGrc8uiag"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "UTS9XcT14H2ZscRIf0MYHQ", "review_id": "4H7xgW7OfFabYK8d4OHFBQ", "stars": 5, "date": "2013-04-01", "text": "I'm so glad I found this place. I was debating whether to leave a four or five star review. Most types of pizza I had here are great and the crust is very good. I decided on the five star review because compared to most other pizza I've had here in Vegas this might be one of the best and they have vegan pizza! I think compared to the best pizza I've had this is around four stars. Regardless it's damned good pizza and thank you Yelp for helping me find it!", "type": "review", "business_id": "B_aOu7idHDU7_5t5RNuydA"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "UTS9XcT14H2ZscRIf0MYHQ", "review_id": "gV_o4GccmUV0sh2g5pPCvA", "stars": 4, "date": "2012-09-30", "text": "Vegans rejoice! It is always nice to have more food options, especially when the food tastes good. I went here for the first time about a month ago on a second date. The location is in one of the large Asian shopping centers along Spring Mountain.\n\nThey definitely try to make the customer feel welcome and have tried their hands at soothing decor, but the ambiance leaves a bit to be desired. The food is pretty good especially the items on the specials. They are seasoned amazingly well. The one dish that turned out less than desirable was the Buddah's Delight. It was quite plain and the veggies a little over cooked.\n\nThe proprietor is very welcoming and brings samples around for tasting so you can see all the other delicious items you could be eating. It definitely gives you and idea of what to order next time!\n\nI hope Vegas continues to foster quality vegetarian restaurants like this.", "type": "review", "business_id": "QY8CBhPwv6dE4onjhj6MDg"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "UTS9XcT14H2ZscRIf0MYHQ", "review_id": "s-aiCkh8152wrVgOcDHOcA", "stars": 1, "date": "2012-09-30", "text": "Let me preface this review with the fact that I did not get a burger... at a burger joint. I know dumb idea to expect a good grilled cheese sandwich, but they had not one but two menu items for grilled cheese sandwiches!\n\nI ordered a grilled cheese sandwich with sautéed onions and mushrooms and a side of french fries. Despite getting regular size fries, the girl dishing out the fries scooped up an extra bit and tossed it in the bag as well. That's about as far as the compliments go in this review.\n\nI really wish I had anything positive to say about the sandwich, but it was pretty terrible all around. The cheese was soft and gooey like a nacho cheese, but lacking in any flavor. In fact 20 minutes later after the cheese had cooled off the cheese was exactly the same consistency. If they use the same cheese for the cheeseburgers, then I can't imagine anyone giving this place high marks. Additionally the bun/bread or whatever it was was soggy with grease and tasteless.\n\nMaybe the burgers here are amazing (though I have serious doubts), but the grilled cheese sandwich left a bad enough taste in my mouth that I will be staying far away from this place.", "type": "review", "business_id": "HI4otGdtdLr-Q294XQFTQQ"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "UTS9XcT14H2ZscRIf0MYHQ", "review_id": "KQfQB-3jyfTv5xdjEmsmmw", "stars": 2, "date": "2012-12-08", "text": "Wow, I'm surprised at the number of high ratings for this place. I went here with a friend after they opened up near where I live. The service was not great and the food was very meh. It seemed like it was probably better if you sat at the bar for drinks than a place to stop in for a pint and some grub at one of the tables. Not impressed.", "type": "review", "business_id": "2OWgXIQIhoWv7Plaug00FQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "UTS9XcT14H2ZscRIf0MYHQ", "review_id": "QZ-2T_qwWfivPAsgTgMQ4Q", "stars": 4, "date": "2013-10-22", "text": "I really enjoy the brunch here. It's good though it has a bit too much of a hipster vibe. The food is not amazingly stand out, though the beignets I recently had were pretty amazing.\n\nIt's a nice place for a casual lunch as well if you have the time. During the week it can be a bit busy for lunch though so be warned.", "type": "review", "business_id": "ZP6qFq7LUh6Tr7WHPoOW6g"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "UTS9XcT14H2ZscRIf0MYHQ", "review_id": "Q0F4JATJWslOXEu2AeSLEw", "stars": 5, "date": "2013-04-01", "text": "The first time I came here I came in between meal times around 3pm during which they have limited menu. I ended up sitting at the bar and having a kale caesar salad and a beer. I enjoyed the salad a lot and figured I'd find the time to give them another try.\n\nSo a few weeks later I came with my girlfriend and I'm super happy I did. The waiter we had was awesome and very friendly. He was also quite boisterous and even cheered some of our dining options. I had the scallops with cauliflower purée which were heavenly. The scallops were nice and flaky and moist. The cauliflower purée made me want to try my hand at something similar at home. I also got a side of the mac'n cheese. I consider myself a connoisseur of grilled cheese sandwiches and mac'n cheese, so believe me when I say it was good. It wasn't amazing, but the texture and sharp flavor of the cheese went well with the veggies.  To wash it all down, I had a cocktail with cucumber soda. It really hit the spot and went well with the meal.\n\nFinally what great meal couldn't benefit from a little dessert. I got the salted caramel ice cream with was quite salty and delicious. I liked it a lot, but I have had better. The total tab was a bit pricey, but when the food is that good it's worth it.", "type": "review", "business_id": "25fxw_jOqZtJwl18cCarIA"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "UTS9XcT14H2ZscRIf0MYHQ", "review_id": "dn73o8y8NNxmP92tWp0fng", "stars": 4, "date": "2012-12-08", "text": "Yelp told me this was a hot new place, so I figured I give it a try. Initially I had a bit of a tough time finding the place, as there was no hint as to where this was from the Yelp reviews. Turns out it is in the Venetian casino area. It's new enough that when I asked someone who worked at the Venetian where it was he said: \"I don't know. Is it new?\"\n\nI ordered take out from the bar as I was grabbing something to go to eat with my girlfriend. I was not too big of a fan of the atmosphere of the restaurant, luckily I was getting food to go. I ended up ordering a veggie burger, an ahi tuna burger, fried pickles, and pickled beets. All told around $50. While I was waiting for the food, I figured I would grab a beer. It took me a bit to decide what I wanted, and when I finally decided it turns out that the beer was nearly tapped out so there wasn't a full glass to be had. While the bartender went to look to see if the keg could be swapped, the food came. I was surprised at just how quickly the food came. So in the end, I got to taste the beer, but did not actually sit and drink a beer. Oh well, maybe next time.\n\nNow onto the food! My girlfriend and I ended up sharing the burgers. The veggie burger seemed like typical fare to me, having previously been a long time vegan, though when my girlfriend tried it she exclaimed \"I don't think this is a veggie burger.\" So it apparently does a decent enough job of masking that it is a veggie burger for some folks.\n\nThe veggie burger was topped with guacamole and was pretty good. I thought the burger itself was a little over done, but overall yummy. The ahi tuna burger, was tasty as well, but my girlfriend and I both agreed that the veggie burger was still a little better.\n\nNow for the pickled delights! This is the first time I've had fried pickles before, and I have to say I really liked them! It's definitely worth a try. If you've had pickled beets before, well these will taste pretty familiar. Overall, I liked the pickled fare as a nice compliment to the burgers, though I really like pickled stuff.\n\nOverall it was nice. It is a change of pace from a lot of the other burger joints in the area.", "type": "review", "business_id": "uExp0zLpyyz3Oaryng_Qeg"}
