{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "QzjRXUNSGk3PySEcg5y92g", "stars": 5, "date": "2014-12-12", "text": "I love Dr. Goldberg. Best doctor I've ever had, and I've had a bunch after moving around a lot in the past 25 years. Good listener, friendly & straightforward. Always presents options and takes a \"let's try the least extreme course\" first. Office staff has improved tremendously since Dr. Johnson left. Highest recommendation.", "type": "review", "business_id": "vcNAWiLM4dR7D2nwwJ7nCA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "b-RO03WKQOusteYMUzhI_Q", "stars": 4, "date": "2013-11-17", "text": "Always solid. My kid's favorite for sit-down or take-out classics. We stopped here on Saturday afternoon with friends who had never been. My daughter had (as always) beef chow fun. Fat rice noodles, tons of scallions and onions. Just a big ol' plate of comfort food. Sweet & sour chicken for her friend, who loved it. We shared a delicious salt & pepper shrimp dish, some hot & sour soup and crispy that was as good as I've had anywhere. Bonus points to the server for taking the time to speak in Mandarin with my daughter's friend, who is 2 years into learning to speak the language.", "type": "review", "business_id": "-3WVw1TNQbPBzaKCaQQ1AQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "DvHvGIM1Subq2LeHgeKQug", "stars": 4, "date": "2011-03-28", "text": "Love the food -- terrific thin crust pizza, Italian Gold wings (honey mustard BBQ), and great beer choices.  Very kid-friendly; kids menu is good, and they bring them dough balls to play with.  The Pizookie (a giant mostly-baked cookie topped with 3 scoops of ice cream) is inventive and a great way to share a dessery.  Servers are usually fun and attentive.  The only thing that stops us from going more often is that it's too damn crowded.  30 -60 minute waits are not uncommon.", "type": "review", "business_id": "ML1RJdeZ7bbfMrHvJ7m99A"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "o3MWIo2njq3m3msY1e0Yxw", "stars": 2, "date": "2014-04-30", "text": "I've had it with these folks. Tired of my dress shirts coming back with machine marks or \"sorry, but this stain won't come out\" notes (that I then easily remove with Spray & Wash and a spin in our washing machine). I've never had these problems anywhere else, but I get it from Rainbow every 2nd or 3rd time I send a batch of shirts. Decent enough service & speed, but they just can't seem to get the cleaning right. I'm done.", "type": "review", "business_id": "M42cmx09Crui_rKeUo7PdQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "XWi1GmKmRK0LsYh1dC-EcA", "stars": 4, "date": "2012-04-02", "text": "Everything about the experience here is really good.  Maybe nothing unique & signature that will make you say \"I ABSOLUTELY MUST go back there\", but everything was well done\n\nGrade A service. Had a reservation, got seated immediately and by a friendly hostess. Water was poured within a minute and server was there shortly thereafter.  Service was attentive and super-friendly & helpful.\n\nNice atmosphere - classy casual, just enough energy.\n\nGreat beer list for me and nice wine special for wifey.\n\nHer almond crusted tilapia was really good (so she said) and an enormous portion - leftovers for dinner the next night. My house pasta (steak and shrimp over pasta in a not-too-heavy garlicky butter sauce) was also terrific.\n\nDessert menu looked good, but we were stuffed.\n\nWe'll be back.", "type": "review", "business_id": "Pfb6VOIiroqDWOebfgWGPQ"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "Ua1Tv09aarqzvWLmhrfKlA", "stars": 2, "date": "2011-10-17", "text": "Should be renamed The Tofu Hut.  Went here with \"mostly-vegan\" relatives who recommended it highly.  Restaurant itself feels like a converted fast-food joint.  Service was very prompt and friendly (one star for food, one star for ambience, four stars for service) -- server took time to explain a number of items to my wife.  Biggest disappointment was that almost every dish included (or centered around) some sort of soy protein or tofu.  Hello!  There are tons of ways to be delicious vegan dishes that don't include the abomination (to me) that tofu is from a taste and mouthfeel standpoint.  Wife did not like her faux fish entree, the wonton soup was o.k., as was my veggie Mu Shu.  Next time, it's off to Cafe Lalibela, or any good italian or middle eastern place.", "type": "review", "business_id": "_ODHYjCmrb3W9hIGJI1uaA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "_KiQ6nVJoLxE40X4CawU8g", "stars": 5, "date": "2012-05-24", "text": "Can't believe this place isn't better-reviewed. Have probably been here a dozen times and never had an item I didn't like. Starters are always fab -- wonderful black bean and chicken soups, kids love the plantain chips and black bean dipping sauce. I would go here just for the bacon-wrapped chorizo-stuffed dates. Meaty, salty, sweet luscious goodness? Yes, please. They do a wonderful (and HUGE) arroz con pollo, and their caribbean chicken with black beans and rice is also to die for.  Friendly service, nice location, Havana Cafe is always a winner.", "type": "review", "business_id": "yJr24Yy1K6bt2G9fX3_zPA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "nwS_Obtle639rhJ-AeY9QA", "stars": 4, "date": "2011-08-18", "text": "Great place for a cheesesteak.  I'm a Philly native, and these guys do it better than any of the many other places I've tried in the Valley.  Wife and kids say the hoagies are really good, as well.  Nice that they also offer a 1/4-size (in addition to the traditional 1/2 and Full) for smaller appetites.  Fries and rings are consistent.  \n\nWhy not 5 stars?  Beer choice is limited if you like microbrews/ales, service inside tends to be slow, pizza is pretty non-descript and wings are just o.k.", "type": "review", "business_id": "lf42gtgq_2_jPvjfp_K1nQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "oHujm5z3frB-9BL3i3KIKg", "stars": 4, "date": "2013-02-27", "text": "May not be \"authentic\" Vietnamese, but that doesn't mean it's not terrific. Went back today and had the Tealight Special - a good size bowl of Chicken Pho, a spring roll (shrimp, noodles and veggies in a rice wrapper) and two small pork & veggie eggrolls. Dipping sauces add just the right balance of sweet, sour and salty. The fresh basil is the perfect addition to the Pho -- love to rip it up and add it all into the bowl. So fragrant. Good, good stuff. A big, tasty change-of-pace lunch for about $9.00. All good.", "type": "review", "business_id": "L_MtTn4IUBTmQtqqM2iFqA"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "-DIcnDBrP7eTF3__TVjfrw", "stars": 5, "date": "2012-07-09", "text": "Just did a summer staycation there. Everything about this place is wonderful. Outstanding customer service 100% of the time -- wonderfully accommodating staff everywhere. The steady stream of free goodies poolside is delightful (Otter Pops! Vanilla Iced Coffee Shooters! Cucumbers to eat, or for your eyes! Evian Facial Mist! Fresh pineapple!). Just little touches everywhere that you don't find anywhere else. Great place for adults, as there aren't too many kids running around. Even the cheapest rooms are beautiful, with nice views. You'll pay for the privilege, but you'll struggle to find a better experience.", "type": "review", "business_id": "QniH_NAABATeAx45mQ4ESQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "1jQBY8mvqW-TbFndAwfAag", "stars": 5, "date": "2011-11-14", "text": "Had about 2 dozen friends in for an event and stopped in here after a day of hiking in Sedona.  Without notice, they opened up a separate room for us.  Service was terrific, the pies were OUTSTANDING, and our snacks/appetizers were really good.  Super friendly, and lots of fun.  An Arizona treasure.", "type": "review", "business_id": "dNsKB5LA2Mf8BDqTS_FAIA"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "zvPFD5PPG9dFAZw8qgtq1g", "stars": 5, "date": "2012-05-21", "text": "Absolutely. Something for everyone, and a unique place for Phoenix . I won't debate how it compares to chicken & waffles places in the South or in L.A., all I can say is that every meal I've had here has been terrific. Fried chicken is the perfect balance of crispy and juicy.  The cinnamon-y (is that a word?) waffles are tender and melt in your mouth. A nice splash of maple syrup and there's no need for the ice-cream-sized scoop[ of butter sitting on top.  Cornbread and sweet potatoes are also good. I'm not a fan of greens, okra or mac & cheese, but my family and friends vouch for their excellence. Service is always friendly. So, so good.", "type": "review", "business_id": "K8pM6qQdYu5h6buRE1-_sw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "LyjiiXw8SI_MomCJKCxBIg", "stars": 4, "date": "2011-08-18", "text": "Very consistent place for breakfast with the kids.  Pancakes are always terrific, and I like that I can order a single pancake (they're HUGE; if you're eating a stack of these, be prepared for a nap).  Servers are always super-friendly, and very attentive if the place isn't jammed.  Kids' meals are a terrific deal.   Nice that they have flavored creamers to go with the coffee.  Not as funky & flavorful as Matt's Big Breakfast, but no wait, and a lot cheaper.", "type": "review", "business_id": "-1bOb2izeJBZjHC7NWxiPA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "yoxpy-0MiRySO5Q09I-n1A", "stars": 4, "date": "2012-05-24", "text": "Super-friendly service. Absolutely adore their chicken mole. My wife literally asks them for a cupful to take home almost every time we go. They do the Mexican staples well, and my kids love it, too", "type": "review", "business_id": "2HHf0hiKtZm5nzt3irlaDA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "kZwftubLCHQjGko9VY9Cxw", "stars": 3, "date": "2014-05-13", "text": "Nice enough place for a drink and some bar food by the plaza. Nice selection of reasonably-priced craft brews. Some good people-watching to be had. Went there Saturday night for a fundraiser. They had some live music going (70's covers). Wings were fine, service was fine. Just nothing noteworthy to make me want to come back.", "type": "review", "business_id": "sYZt3f1YFlg0ycDMyO-vJw"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "H82wvvbcCAIxNjiibxsCyQ", "stars": 5, "date": "2012-07-02", "text": "Amazing. Perfect for a romantic dinner. Booked through Open Table and mentioned it was our anniversary; everyone who greeted us congratulated us. Asked us if we were interested in dining in the wine cellar room; quieter and more private. Beautiful there, but really cold -- they have blankets if you like. Meal was impeccable. Wife loved her heirloom tomato salad and halibut entree. My tortilla soup starter was perfect. The Three Little Pigs entree (barbecued loin, crisped pork belly, and braised [?] cheeks). Whimsical, fun, delicious and perfectly cooked. When I asked the server to sub something in for the polenta, he said, \"Of course, what would you like\"? Terrific wine list and beer menu. Service was right on point -- attentive, friendly, accommodating. Our Peaches & Cream Beignets dessert arrived with \"Happy Anniversary written in chocolate on the bowl, and was comped. Literally nothing I would change about the meal or the experience. Well done!", "type": "review", "business_id": "EHi-lebXGWjSktl4WvSoow"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "jb7bCsImD8b7myVsQnvtFQ", "stars": 4, "date": "2011-08-21", "text": "Really good, really unique.  I had never had Ethiopian food, but we went out with (vegetarian) friends who recommended it, and we're always game for something new.\n\nSuper-friendly owner and waitstaff.  The food was super tasty and lots of fun.  I decided to pass on the meat dishes and go veggie like our friends did, and we had a wonderful array of stews.  I ordered the vegetarian  was terrific.  A couple of lentil dishes, chickpeas, split yellow peas, string beans w/carrots & onions, and a potato/cabbage mix.  Really tasty, and fun to pick up the stews with the injera (kind of like a firmer crepe/pancake.  Reminded me of eating a mix of Moroccan, Lebanese and Indian foods.  So good.\n\nThe iced black tea (with cinnamon, cardamom & cloves) is a great accompaniment. \n\nWe'll be back.", "type": "review", "business_id": "-bd26a1QEEpqUZjBmtBUiQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "1K4YTPTKJ5zKhAO10bpzFw", "stars": 4, "date": "2011-03-28", "text": "Unique, fun, funky, tasty, divey.  Chino Bandido is a bizarro mix of chinese and mexican.  Order up front (their way or the highway).  Big portions served in tin-foil to-go containers.  Mostly clean seating area with big community tables and some smaller 2/4/6-tops.  Love the Jade Red Chicken -- sweet and spicy.  Whatever you order, make sure to get the black beans (and rice) as a side; they taste like nothing else.  Snickerdoodle cookie (great) comes with every entree, or a mudslide cookie (awesome) on the weekends.  Only downside is sketch service -- try to avoid dinner rush, where you may wait in line for 15-30 minutes to order and 30 minutes or more for your food to arrive.", "type": "review", "business_id": "Zx8_4zKdDBSO3qGrkukBIA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "GAw_EMuMk241Dy--x9O80w", "stars": 2, "date": "2013-12-09", "text": "Can't recommend it. 4 star food, 2 star service, but you have to do better than that at $100+ per head. \n\nWe had a party of 8 (four couples) there on Saturday night. Our server was really indifferent, right from the get-go. No smiling, no personality. Borderline unfriendly/unpleasant. And it didn't get better as the meal went on. It's not like they were slammed with a huge crowd, either. Other table attendants (water, bread) were super pleasant and on their game, though. Service was slow -- slow to take drink orders, slow to deliver them, slow to take dinner orders, slow to bring meals, slow to bring dessert menus, slow to bring the check... Our steaks were really good, our friends raved about the Lobster Pot Pie and everyone who ordered the Chilean Sea Bass loved it. Sides (beets, truffled polenta and a 3rd [kale?] that I've already forgotten) were... forgettable.\n\nAgain, a good meal, but not a great one, and subpar service in a place where you're paying for 5-star service. A disappointing experience after a great visit to American Fish and BLT Steak in Scottsdale.\n\nToo bad.", "type": "review", "business_id": "ZNdsRbGeOfrYYPRl6AziCQ"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "M7uP6Rtapr96FgCf5nwpoA", "stars": 4, "date": "2012-05-04", "text": "Ex-East-Coaster that I am, I am always looking for a good traditional pizza and a Philly Cheesesteak. 5 stars for the pizza here - just like I used to have growing up. 3 stars for the cheesesteaks -- good but not great, and a bit overpriced. I prefer Uncle Sam's, just up the 51 a bit, but I suppose that's just personal preference. Service is solid; last time I came in for take-out they burned my pizza, so they made me a new one for free. That's how you treat customers.", "type": "review", "business_id": "-yzl8Zm-MmSqx31VN7vB0Q"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "dxvzFMBGzCs-iyR8P6ZAjg", "stars": 3, "date": "2014-04-30", "text": "Nothing to see here, move along. Average at best. I've had takeout from here twice and have been less-than-enthused. First time was minestrone soup (ok) and meatball sandwich (average). Yesterday was a Margherita pizza - nice crispy crust, decent size pools of fresh mozzarella and shreds of basil. Weird tomatoes; instead of slices, it was grape/cherry tomatoes cut in half and stuffed with garlic. Huh? I don't need tomatoes that squirt at me when I bit into them. I loves me some garlic, but between that and the chunks on the pizza, it was wayyyyy too overwhelming.", "type": "review", "business_id": "V3djRRU0eJcyI5lZ6Tw6RQ"}
{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "b0e7qi7AcPuVrWQH9klivA", "stars": 4, "date": "2012-04-12", "text": "VALUE! VALUE! VALUE! Is it the best Chinese meal you'll ever have? Lord, I hope not. But it's good \"traditional\" Chinese food dirt cheap. $3.98 lunch bowl is the best bargain in the Valley. A big-a$$ platter of Black Pepper Chicken or Hawaiian Sauce (sorta Teriyaki-ish) Pork or Chicken over brown rice is just the thing. Hot, tasty, filling, comforting and inexpensive. Love this place!", "type": "review", "business_id": "XMRj865sZBPWCI7tx0uBWw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "OFf9h5WAhBZxZD6M8uOjGQ", "stars": 3, "date": "2011-08-27", "text": "Great place if you have a dining partner who needs gluten-free, but other than that, it's just o.k.  Nice atmosphere, good baked wings, decent beer selection.   Traditional pizza is nothing to write home about. Everything is a bit overpriced.  We just go here when we happen to be in Scottsdale and don't want to wait in a long line at Oregano's or drive back home to eat at Babbo.\n\nAgree with some of the other comments that the food and menu seems to have lost a step in the past 2-3 years, but I can't quite put my finger on it.", "type": "review", "business_id": "Jbv39pK_ConiOlS3Rba05g"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "98fwH6XNG4E1hVXzoQlPaw", "stars": 5, "date": "2013-12-09", "text": "Every year we go to Vegas with friends. Every year they drag me to Joe's for lunch. Every year I slog through it because I'm not a seafood lover and I hate big lunches.\n\nThis year, we went for dinner, and it made all the difference. First, I was HUNGRY! Got a lovely (round) table for 8 in the back on Friday night. Service was impeccable. Friendly, attentive & charming. While everyone else was happily seafooding-out, I ordered the double cut lamb chops with mint chimichurri. \"That's a hidden treasure\", said our server.  Was she ever right. 3 or 4 big, meaty, double-cut chops. Perfectly cooked and seasoned. Great selection of craft brews (I had a Stone Pale Ale and Ruination ale).\n\nNice to have meat/beef options that are truly a delight, and not just an afterthought. They brought dessert for our friends birthday, too. Wonderful. Great food, great atmosphere, great service, worth every penny. Well worth the $100/head.", "type": "review", "business_id": "LLDGTT7FExklkQvHebEjRg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "1TB-ciEMCZdIq6qa4gsj0w", "stars": 4, "date": "2012-03-11", "text": "Love the venue and the service, but food was not spectacular.  Sat and had a couple beverages in the side-by-side leather seats. Very cool and intimate, nice vibe here. Wife LOVED her red sangria, and they had some really good craft brews that kept me happy. Server was friendly and attentive. My burger was prepared just as I ordered, and was solid.  Wife's pasta with salmon was just o.k. - nothin' special. Fun place to hang.", "type": "review", "business_id": "IVc23uY-36WUNYoIbz42Fg"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "7VH_3S9pbT0AaagEAhhNkw", "stars": 4, "date": "2013-07-07", "text": "Surprisingly good fare, excellent service. I wouldn't have expected the on-property restaurant at Firesky Resort to be great, but we had a $50 credit, so here goes... Started with the charred octopus appetizer. May have been the best octopus dish I've ever had -- cooked perfectly, complemented well by the fennel and peppers. My sausage pizza was really good -- not Federal Pizza or Bianco \"good\", but really good; thin, crisp, tasty, well-rounded flavors. Server even brought me a small ramekan of oregano when I asked. Wifey enjoyed her pasta with langostines. Since it was our anniversary, they comped us dessert - a lovely assortment of cannolis cleverly garnished with fruits and herbs. Again, thoughtful & creative fare. Good stuff", "type": "review", "business_id": "On_3zLdujQdvDbBYUirNWw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "Ei-nVsS9gY1tMsbVwMvpFw", "stars": 2, "date": "2010-11-16", "text": "Not bad, but no great shakes.  The \"large\" pulled pork sandwich was hefty, but kinda bland.  Lots of sauce helped.  Sweet potato fries were underdone and way too cinnamon-sugared.  Service was indifferent.  You can get better barbecue in plenty of places in Phoenix.", "type": "review", "business_id": "asebFFgabg_lfoNpGJHZlQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "xc3kOpZOANVA9E9Ce_z4vg", "stars": 4, "date": "2012-09-20", "text": "Really, really good. Love the look and feel of this place. Went for Arizona Restaurant Week. Food was outstanding -- loved my sausage appetizer over a bed of red pea puree, maccharoncini (?) with short rib ragout entree was super, chocolate flan (recommended by server) was heavenly. Wife loved her cheese board app & cioppino entree, her compressed fruit soup sounded better than it was. Some nice surprises -- an amuse bouche of tomato, caper & olive oil, and a mound of green apple cotton candy served pre-dessert (not my cup of tea, but a fun idea) . \n\nDownsides -- service was great when our server was present, but it was often a while between her visits (well, it was a Saturday night during Restaurant Week). Also, they were out of the only two beers/ales I wanted.  Really? Someone could have walked 100 feet over to the Safeway and picked up more. I almost asked them to do that just to see how they'd respond, but chickened out.  All in all, a really good meal and night out.", "type": "review", "business_id": "DcrM4hwDcU2G6vuh2cnaYQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "2Swh55U-cQF33IeDuDM70w", "stars": 3, "date": "2013-04-25", "text": "Three stars for the food & value, five stars for the service. Went here with a party of six. Patio seating was lovely. \n\nDownside -- We ordered a bunch of appetizers (guac, grilled corn) were solid, if uneventful. For the prices you pay, I would have expected better food and/or larger portions. Shared the pork shoulder taco entree-for-two with my friend; they were good (not great) and not much of them. Our friends seemed to enjoy what they had.\n\nUpside - My wife's scallops came out way-too-salty. She asked the server to have them redone, and they came back oversalted a 2nd time. This time the manager came over, apologized profusely, and offered to comp her a different entree. By this time she had been nibbling on appetizers and just wasn't interested in another entree, so they brought us a variety of desserts (comped) for the table to share. \n\nThat's how you treat guests and solve a problem. Extremely well-handled by the server and manager, which is enough to have us give The Mission another try this weekend.", "type": "review", "business_id": "YKOvlBNkF4KpUP9q7x862w"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "704rGU2O0lIfD3usLMp80Q", "stars": 5, "date": "2013-08-26", "text": "If you know what you want and you're prepared, Fogo de Chao is 5 stars. Practically starved myself all day so I could indulge. Father-in-law and I were greeted warmly by the hostess. Stopped in the bar for a drink and had a nice glass of wine, server was friendly & helpful. Server explained the concept to my FIL, who had never been to a churrascaria. Salad bar was nice, just icked up a few nibbles (olives, prosciutto, roasted peppers...) to complement the upcoming meatfest. \n\nIt's all about knowing what you like.\n\nBest of the meats: the two top sirloin selections are spectacular, as was the lamb chop and lamb t-bone. Juicy & flavorful/ Ribeye was super tasty. \n\nWorst - leg of lamb was overmarinated, the pork ribs were cooked fine but needed some sort of rub/seasoning, the bottom sirloin had great texture but was kind of bland.\n\nPassed on the chicken, sausages and filet mignon.\n\nService was prompt, attentive and polite without being overbearing.\n\nA great meal, and a fun/different experience.", "type": "review", "business_id": "OE5nAmaSVaopeRS1Cs9Kuw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "momo3pHfToYaAf9T86ArmA", "stars": 4, "date": "2012-12-10", "text": "Solid gourmet brick oven pizzas, good craft brews on tap, friendly service, and a covered patio. What's not to like? Consistently good, and the Pizza & Salad lunch combos are a nice change of pace. Had the Meat Lovers pie this weekend, and it is pork-tastic.", "type": "review", "business_id": "Lbue8gqRiBPEnA7g7H1qdw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "nS9eDypV88dUnfOt6rlW8Q", "stars": 5, "date": "2011-06-12", "text": "In my mind, most of the new DIY fro-yo places are pretty much the same.  What makes Mojo best?  Best fruit flavors (they almost always have either Pom-NRG or Acai available), best fresh fruit toppings, and the availability of BOGO coupons via the web.  My choice over Yogurtology, Zoyo, and the other 5-10 places I've tried in the Valley.", "type": "review", "business_id": "nFBse3YXN8CP1cDieyLz6A"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "pdq8i5QnAHxu1xbwRCVVPQ", "stars": 5, "date": "2014-04-21", "text": "Love the Freakin' Frog. Massive selection of craft brews on site and a big variety on draft. Adam and his staff are very knowledgeable and can make great recommendations based on what you like. Went here with a group of 3 other couples. The ladies weren't beer drinkers, so Adam hooked them up with Framboises and Lambics. I tried a couple of Cali & Oregon IPAs they had on tap. He brought out samples of Freakin' Lightning (white whiskey) for us to sample. Very cool. You don't come here for the food, but the food we ordered was excellent -- Plate O'Bacon, giant tray of nachos, all good stuff. I'll be back next time we're in town.", "type": "review", "business_id": "6uZqR0MsU9UMEX_FftYSdA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "fLsCnokYsK1PboPWP1hVPQ", "stars": 4, "date": "2011-11-18", "text": "Creative, excellent food with good service, but you'll pay.  I had an amazing mascarpone (not MARscapone, dammit!) stuffed french toast.  Fascinating preparation, as it was served as a \"brick\" (imagine quartering a loaf of bread and then splitting it in half).  Had a honey drizzle, some luscious strawberries and real maple syrup.  Absolutely delicious.  My friend's omelet was equally as tasty.  Setting is gorgeous and service was good.  Only downside is resort pricing -- $11 for the (admittedly excellent) french toast and $4 for coffee (I passed).  Yum.", "type": "review", "business_id": "qkbloHdDZuHf_0wTqUGPjQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "lTwuZduTclR5Z98R-47wBg", "stars": 4, "date": "2011-09-05", "text": "Large portions of good food, well-prepared, with friendly service at a reasonable price.  Not high-end gourmet Italian, but everything is done well.  My daughters could live alone on the bread that comes with every meal.  The roasted asparagus appetizer is a big hit.  The individual and family size pizzas are excellent.  Creative pastas and salads.  We've never had a bad meal here, and there's always leftovers.", "type": "review", "business_id": "RGDyf8-PyzyS9Lzs9bkvgA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "xDPbCp1ukRuU2CcK894sHg", "stars": 1, "date": "2010-02-09", "text": "Brutal service, boring food, Cougar Town.  Been there twice, both times waited over 20 minutes to have our order taken.  Then another 45-60 minutes to get the food, which was totally unremarkable.  Sounds great on paper (local, organic, etc.) but it just doesn't translate to the taste.  Good beer selection and that's about all that's going for it.  Too bad, because it's a neat venue.  Someone sank a bunch of money into it, but the payoff just isn't there.  With all the options available nearby, can't see why anyone would go there.", "type": "review", "business_id": "l5GGMobHJvzaQO2rZFwdTQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "VbWluC5KeWH9KRBp7KKGww", "stars": 4, "date": "2010-11-29", "text": "Now we're talking.  Fabulous tacos -- the Chicken Tinga is amazing, as is the Cochinita Pibil.  The salsa bar is amazing; lots of choices, some of them specialized for your taco/burrito.  Reasonably priced hole-in-the-wall.  Service is just o.k. and it gets hot in the summer (no/weak A.C.), but the food and the value are excellent.", "type": "review", "business_id": "zp713qNhx8d9KCJJnrw1xA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "3A-0AN5bruHXXmo6_7tCRw", "stars": 5, "date": "2013-02-04", "text": "Love this place. Great service & vibe. Stopped in for a beverage while my daughter was at soccer. Just wanted a large black coffee with a shot of hazelnut. Barista asked me how dark I like my roast, and I told him I like it light. He said they only had dark roast brewed so he walked me through some light roast options and brewed me a fresh cup (and then a free refill). Super friendly. If you like indie & new wave 80's & 90's tunes (yup, that's me), this is a great place to chill with a delicious beverage. At least on a Tuesday at 5:00 p.m.", "type": "review", "business_id": "e9djgIbIn-toCOwmRTpgCw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "rn2PsPnZBNVM7lDXyT1E2A", "stars": 4, "date": "2013-02-14", "text": "Typical \"bertos\"-style Mexican joint, BUT.... The $1.99 red chicken burrito on Monday/Tuesday/Wednesday is the bomb.  Ginormous, meaty and just spicy enough. Can't beat the value.", "type": "review", "business_id": "Dcs_jLOlNXd96LarVInFgg"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "YZtMHwMoTsPKwOeo5VR9ng", "stars": 3, "date": "2012-04-12", "text": "Not awful, but certainly not that good. After 4-5 visits, I only go there in a pinch, or when I'm asked to meet others there.  I wish it were better, because it's so close.\n\nThe good: Decent craft beer selection, terrific service, great location, patio dining.\n\nThe bad: Underportioned for the price (sides/fries are much bigger at Delux), quality (burgers aren't as good or as imaginative as at The Grind).\n\nI'm happy to drop $15 for a big, awesome burger and a big order of really well done fries. But Zinburger doesn't deliver that.\n\nWent again last night for a get-together and tried the Asian Chicken Salad -- small portion for $10 or $11 and totally unmemorable. Had a nice Four Peaks Ale and Sierra Nevada, though.", "type": "review", "business_id": "cp39VURFby4A6u9m2It8jg"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "XOWnHFnd_ZeTO_e8Z07zwQ", "stars": 4, "date": "2011-03-14", "text": "Great, inspired bar food in an upbeat, raucous environment.  Had a nice weekend dinner there with a business associate.  Sadly, they don't have the pullled pork sandwich on a pretzel bun that's at the 40th St. location, but the Persion Chicken Kebabs more than made up for it.  Terrific draft and bottled beer selection for folks like me that like microbrewed pale ales and IPAs.  Went back with my wife and another couple for a Friday happy hour ($5 plates, drink specials) that turned into 4 hours.  Great Indian pizza and fun appetizers.  Very attentive service both times I've been there.  One word of caution -- it can get LOUD, especially at happy hour.", "type": "review", "business_id": "WS1z1OAR0tRl4FsjdTGUFQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "D6Wu7VPtH8UpeD0C-f1dng", "stars": 4, "date": "2014-05-05", "text": "Fun & funky. We went there on a Sunday late afternoon, so it wasn't very crowded. I'm sure it's a MUCH different vibe at night or on the weekends. Lots of retro kitsch all over the place, in a good way. Plenty of games to play and things to see. A couple of craft beers available, but I decided to go \"ironic\" and get a Hamm's and a Schlitz. Yup, just as crappy as I ever remembered, but brought back great memories. Food was good - ribs and housemade chips, sliders and salads for friends and kids. Servers were super-friendly. My only complaint -- on a 100 degree day it gets HOT in there. Uncomfortably hot. Could really use some A/C or even some much stronger fans.", "type": "review", "business_id": "OdD1GuGNQ64ssJmMJ_D9RQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "f6lMgPvnCqHTDrRur-b16w", "stars": 2, "date": "2010-11-16", "text": "Totally hit and miss.  One of the cleaner/nicer BBQ joints you'll find.  Kind of halfway between a dive and a sit-down casual BBQ restaurant.  Robs weren't cheap, but a large meaty rack.  Sauce was good, but would have preferred having sauce choices.  Pulled pork sandwich was just o.k.  Smoked chicken was bland and not worth it.  Some sides were great (fries), some o.k. (cole slaw), some were weak (cornbread, beans).  Just no great reason to go back", "type": "review", "business_id": "4DhqZ0tyi2V2Mp8IqTREAA"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "63-ExswABO4wE3pNOVDhuA", "stars": 1, "date": "2012-10-22", "text": "Very strange -- I can't reconcile all the positive reviews with my own personal experience. Called them up due to the overwhelmingly positive feedback on Yelp. \n\nI had a few sprinkler heads that needed to be replaced/repaired/adjusted before I overseeded. Eli got back to me quickly and set an appointment on a day when I'd be at work, which was fine. On the day of the appointment, I got a call from the service tech telling me that my sprinklers were fine but my controller was broken, and it would be $385 to replace. I told him that the controller isn't broken -- one of the buttons is \"sticky\", but the system is fine. On the other hand, the sprinklers are not \"fine\", that's why I called. He told me the system was old and should be replaced. I gently told him that I would consider that, but I wasn't going to authorize a $385 replacement without getting a competitive bid, but in the meantime, would he please run and repair the sprinkler heads as I requested -- I mentioned the specific ones I had concerns about. He barked at me, but agreed to do so. I still haven't seen any paperwork or notice regarding what he did.\n\nMaybe the service tech was just having a bad day, but I can't recommend these guys.\n\nAppreciate that at least the owner posts productive and rational responses to reviews that show opportunities to improve. Nice to know that someone might be listening.", "type": "review", "business_id": "mYb8VyXUx7MA_wLPMWFl2w"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "j0zUDj_d33NT9Gzy4jxung", "stars": 4, "date": "2013-08-18", "text": "5 star pancakes, 3 star service and facilities. The pancakes are perfect. Super light and fluffy. A \"short stack\" (two big pancakes) is perfect for a normal human being. Service is just so-so -- nice enough, but slow/infrequent. And what's up with the low/no AC policy at 11:00 a.m. in August? You do NOT want to be sitting in the front section of the restaurant. At least there was a big floor fan sending air to the back room, but nothing up front. I'd enjoy my breakfast a lot more if it weren't 85-90 degrees in there.", "type": "review", "business_id": "D1T1jtCfTfXD-cQE3QViow"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "SzbpQwKMFDMbUsbrw5flfQ", "stars": 4, "date": "2010-11-29", "text": "Went there only because we wanted an outside table nearby on short notice.  Assumed it would be overpriced and just o.k., since it's on gotel grounds (Hilton Squaw Peak).  SOOO much better than when this place was the Lantana Grill.  My wife and stepmother raved about their fish (halibut & salmon).   My daughter and I had great burgers/fries.  Great microbrew menu.  Service was attentive.  Decent value.  Well worth a visit.", "type": "review", "business_id": "7LGjM8HKJTwqfYU3C7N_0w"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "RitoIRYCWBUzW85jYlRrWw", "stars": 5, "date": "2012-03-19", "text": "Love this place. Inspired, creative, and beautifully prepared farm-to-table cuisine. Just got back from 2nd time here and it confirmed that the 1st dinner was no fluke. Nicely diverse menu, love the use of seasonal and organic veggies. Everything I've ordered or tasted here (Duck Three Ways entree special, Pork Osso Buco entree, various appetizers, sides & desserts) has been outstanding. Service has always been warm and attentive, even on an uber-busy Saturday night. Like the open kitchen and the whole vibe here; energetic but not too loud & hectic.  Enjoyed the 50% off Sunday Night special on Arizona wines -- surprised my out-of-town snobby parents (\"Arizona wine? That can't be any good\") with a wonderful Keeling Schaefer Syrah. Prices are way reasonable (entrees $12-$21) for the quality and portions. A great evening out.", "type": "review", "business_id": "I4bSn5gXsHuSPu7L-d_8nQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "vxiMJdvWCsWX9MUDxfz6kw", "stars": 4, "date": "2011-03-14", "text": "Great upscale sitdown taco restaurant from the folks who run the fabulous Fuego Bistro.  $8 - $10 at lunch gets you two substantial tacos, black beans and arroz con gandules (tasty rice with pigeon peas).  Pernil Asado (marinated pork shoulder with mango chile salsa) was fabulous and my colleague loved her veggie tacos.  Downsides -- a bit dark inside and service is just o.k. (attentive but not particularly pleasant/inviting).  Well worth another visit.", "type": "review", "business_id": "KBKDl08flVw1AqvM5ucVpA"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "9xB_rTJGeo5gwCSj9JwI3Q", "stars": 4, "date": "2011-12-15", "text": "Really, really different.  In a good way.  Took my 12-year-old here after a soccer match and we both loved it. She had the Pizza Rustica with meat, but with the shredded mozzarella.  Wolfed down the whole thing and said, \"we are definitely coming back here\".  I loved my Pizza Rustica, which came with fresh mozzarella, marinated tomatoes and fresh basil.  Rich flavorful sauce with lots of herbs.  A crust that marries crispness and softness.  As good as any basic pizza I've had here in the Valley (up there with Humble Pie and Pizzeria Bianco).  Five star food.  Service was solid, if unspectacular.  Disappointed in the beer selection -- no pale ales or IPAs, nothing on tap.  To-go packaging was bizarre; basically placed the leftover slices on a stack of 3 paper plates and stuffed it in a (open) bag.  Huh?", "type": "review", "business_id": "eFA9dqXT5EA_TrMgbo03QQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "yT3aUSFpgTwwjlpGSvfTiQ", "stars": 4, "date": "2013-09-24", "text": "Wifey and daughter stopped by and picked up the Monday night 20\" $10 pie. Really, really good, and no better value out there.", "type": "review", "business_id": "eFA9dqXT5EA_TrMgbo03QQ"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "tHqfU7d0MgtS7BGHvCrwiw", "stars": 4, "date": "2011-01-11", "text": "Really, really good.  Most/all of the items/dishes on the menu have a local/organic/better-for-you feel.  Friendly and attentive service.  I had a WONDERFUL barbecued pork sandwich -- tender, flavorful, great slaw, fresh egg bun, and HUGE.  Sweet potato tater tots were novel, and very tasty.  Nice (short) list of microbrews for the next time I go.  Breakfast menu looked interesting, too.  Covered patio.", "type": "review", "business_id": "vvMR0jgDoBA-g1XgZy8sEg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "O_Y9rYHQ7ntTn0hfL5sYfA", "stars": 4, "date": "2012-01-08", "text": "Good food, great vibe, excellent attitude. Had driven by here several times after it converted from a drive-thru coffee kiosk, but never stopped in.  Dined there last night on the reco from our movie-and-dinner partners.  It was a little chilly to eat on the outdoor patio by 8:30, but it's nice to know it's there.  Inside was cozy (maybe seating for 30 or so), and funky/hip without being pretentious.  Menu is compact - a handful of foodie-oriented salads, sandwiches and entrees and a daily special entree and lavosh pizza.   Our flatbread appetizers were nicely done.  My gumbo was absolutely delicious. The fresh basil leaves (from the garden outside) were a thoughtful, unexpected and delicious touch. Wife's roast beef sliders were also good. Great selection of local craft beers available.  Server was uber-friendly and helpful. Owner walked over and chatted with us. We'll definitely put it in the rotation.  I wouldn't drive a long way for it, but its a great neighborhood joint for a 5-10 minute drive.", "type": "review", "business_id": "XU5Fb3TosXDUJcNRWQM5cA"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "Yf778d4NlHKoIvuRnt0G-w", "stars": 5, "date": "2011-12-06", "text": "What you've heard/read is all true, this place is terrific. $1 street tacos were all amazing -- loved the Al Pastor, Carne Asada was wonderful, Chorizo was excellent, and the Fish my wife ordered was as good as any I've had. The Mole plate was to die for; a little spicier than usual, but rich and complex.  Delicious churros stuffed with flan and drizzled (honey? caramel? don't know & don't care)  As promised, the owner/operator is just a sweet, funny bear of a man.  Order at the counter and he'll bring you your tray.  Taste is right up there with Fuego Tacos and La Condesa, but a lot less expensive (four of us ate wonderfully for $25).  Eat there before word gets out.", "type": "review", "business_id": "wN_wAXWg8W94v04eqijy6g"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "K7yEACZqx37WhQ71qTKuUg", "stars": 2, "date": "2013-08-27", "text": "Stopped in for a business lunch. Nice enough place inside. About 20-25% full. Uh-oh. Good looking craft brews on tap. Menu looked solid. Interesting sandwiches and salads. I ordered the barbecued pulled pork sandwich with onion strings. Onion strings on the sandwich were cold-ish, weird. The pork itself was very bland, and the barbecue sauce was nothing to write home about (I can't explain the reviewer love I see on the postings next to mine). My colleagues seemed to like their meals o.k., but no one was talking about their meals or sharing what they got, so that speaks volumes.\n\nThis place might be worth a shot with a better chef/cook or better recipes. Looks good on paper, but I can't recommend it. Too many good options nearby to make this a go-to place.", "type": "review", "business_id": "GHYOl_cnERMOhkCK_mGAlA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "r8W9teQt70UlvAaG83FlYg", "stars": 4, "date": "2012-05-24", "text": "Almost every fro-yo place feels exactly the same to me. Why did I like Yogurtini so much? Great flavors.  I've sampled other Key Lime fro-yos but this was the first one I enjoyed enough to order -- tart, tangy & creamy.  Same thing with their Dulce de Leche. Other places' version is usually thin and only hints at caramel - Yogurtini's was rich and full. Nice, clean, quiet design. Spacious and calm.", "type": "review", "business_id": "ksotKTjq9bGWnANyZH6IFQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "b6SNigN5JsaG3FZF7iRjkA", "stars": 5, "date": "2011-11-18", "text": "Finally, a decent room for a mid-sized club acts.  My new favorite venue.  Sound is terrific, and there's a section for under-21's if I want to take my daughter.  Nice variety of craft beers on tap or bottled.  Bleachers (hmm, interesting...) or tables if you want to sit, plenty of room in front of the stage if you want to stand. Love, love, love.", "type": "review", "business_id": "qw93CjlAZ6a4ff11Z-hF3Q"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "XZ2DwMExXDKe3eozjEsJqQ", "stars": 5, "date": "2014-10-20", "text": "Excellent. Probably the 4th or 5th sprinkler company I've had come out in our time here in the Valley, because I'm always disappointed or overcharged. Left a message for their office on Wednesday, heard back on Thursday and got a Monday appointment for an 8-11 block. Wade called at 8:00 and was on his way. Told him what I needed (a few heads replaced, spray patterns adjusted). He did that, but also found that pressure was low and found & repaired the leak. In and out in under an hour, super polite and reasonably priced. Will call them again next time in a heartbeat.", "type": "review", "business_id": "7ghgCKJjh7SNKHUIaPB-Nw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "jJyno97f1raxCVuxpuDBcg", "stars": 3, "date": "2011-11-18", "text": "Concept resides squarely between In-n-Out and Five Guys.  Good fast-food burger, but not much more.  Can't compete with Delux, Zinburger & The Grind, but it's cheaper & faster.  Upsides vs. In-n-Out are topping variety (mmm, bacon & BBQ sauce), superior side options (sweet potato fries and onion rings) and char-broiling vs. flat-top grill.  A bit pricier, though.  Nice for a change of pace, perhaps.", "type": "review", "business_id": "BcRb2bBN9pGdV8Ef5-dKUA"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "b31ELqG60idq18A6_cn5Hw", "stars": 3, "date": "2012-11-05", "text": "3.5 stars if I could. Took a flier on North since the 7:30 Saturday night line at Chelsea's Kitchen was immense. We were able to get seated right away. Lovely place, especially on a cool November evening with everything opened up. Patio was nice, service was prompt & attentive and friendly. Wife was starving and they were able to quickly get our fried chickpeas out to us. Nice choice of craft beers. My tagliatelle bolognese was solid, but no more than that. Her Funghi pizza was, too. Best part of the meal -- donuts/profiteroles with lemon curd and mascarpone. Oh yes. All in all, good, but not great.", "type": "review", "business_id": "CSoURupWEyuyzkjMOExKPg"}
{"votes": {"funny": 1, "useful": 3, "cool": 0}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "33nN3M1LqADnGY1LkYBCMQ", "stars": 2, "date": "2012-03-19", "text": "Really wanted to like this place -- it's close, I love chicken, and I love The Grind, but they made it hard to enjoy. Maybe just some opening week rough spots, but I can't recommend it.\n\nWe made a reservation in advance for 6, and they squeezed us into a booth that probably should only hold 4. I can live with that. Nice selection of craft beers and wines, and I like that you can order 1/2 or even 1/4 glasses as a \"taster\".\n\nServer was polite, but tough to track down. Food came out slowly, inaccurately, and was just not that great. Parents' request for white-meat chicken was botched and had to be sent back. Wife's order came out late and was totally wrong, came out wrong a 2nd time, but the 3rd time was the charm. The rotisserie chicken itself was decent, but nothing you couldn't get at several dozen other places in town. Daughter's pork sandwich was practically swimming in the bleu cheese sauce -- guys, a little goes a long way. Wife's fish was o.k., but the chickpea side dish was bland & uninteresting. Creamed corn was very tasty, though. Due to the kitchen/server mishaps, we had to race through dinner even though we had allowed for plenty of time.\n\nOverall, just nothing that would bring me back. Too many other good options around.", "type": "review", "business_id": "Rj5gyaRIIwDX_OJa1LlE4A"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "U9fyMJs4e6P7KdrfMtuAxg", "stars": 4, "date": "2011-11-25", "text": "Tons of potential, a few kinks to work out.  Beautiful space in the Saguaro, which I believe was the Mondrian, the James, and god-knows-what-else in the past several years.  Basically a small bar with a cozy feel and a menu from Iron Chef Jose Garces.  Gorgeous outdoor fireplace area.  We're not whiskey drinkers, but they had several outstanding craft brews available, and I had two of 'em.  The kids loved their S'mores shake.  Menu looked great on paper, but execution was inconsistent.  My buttermilk fried chicken and my daughter's Pork Sammys were AMAZING.  My spouse's burger was waaaay underdone, too soggy, and nothing special.  My older daughter's house salad with chicken was just average.  Service was prompt, attentive and super-friendly.  Having been to a number of Jose Garces' places in Philly, I'm going to assume they'll get it all tightened up soon.  Can't wait for Distrito to open there -- the one in Philadelphia is tremendous.", "type": "review", "business_id": "qyqOfpsAC5ooVROm7fB0jQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "2FT8RFQV1dqt9GxZ3YBN8g", "stars": 5, "date": "2013-07-23", "text": "I love everything Chef Jose Garces touches. Have been here 3 times, and every time has been a little different, but always excellent. Went for a menu tasting with a magazine writer who was doing a feature, so we got to try lots of dishes. Octopus was phenomenal, tender and tasty. Duck was amazing; juicy and crispy. Returned with my wife and she loved her fish, and I enjoyed the carnitas. Went back last week with a group of seven and we shared some apps and the \"group tacos\" -- a nice way to share and enjoy, and tons of flavor in everything.", "type": "review", "business_id": "lKQ5hnkSQ-XP80jNCH46nQ"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "ZEEQ1_R1iSgXQdG2O5z4JQ", "stars": 4, "date": "2014-09-20", "text": "Solid upscale, inventive Mexican fare in a full-service setting. Complimentary chips and salsas were terrific (one traditional, one looked/tasted like black bean & pepitas). The guac app and elote were also solid. I had the grilled quail - very tasty and fun. Wifey and dining companions enjoyed their fish, veggie tacos and margaritas. Props for having a craft brew (Lagunitas IPA) available. Service was very friendly and reasonably prompt. Only downside was that our meals were brought out about 5 minutes after we ordered. Weird -- made it seem like things were all pre-prepped and/or we were being pushed to turn the table.", "type": "review", "business_id": "nFo_63pTr-4ZhakuaRFOCA"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "Ahc76drU_s4y_9UQzSfuVQ", "stars": 5, "date": "2012-12-03", "text": "Yup. It's all true. Great food, super charming place, very intimate. \n\nWe sat outside on the patio under a heat lamp. Enjoyed the olives as a starter, as well as some fried raviolis (yes, please) and a caprese salad app.  Outstanding artisan pizza, with as good a crust as I've ever had, and homemade mozzarella. Wine was just ok, but very reasonable. Server was attentive, helpful and friendly. Owner came by a couple times to check in on us and was absolutely delightful. \n\nDeduct a point for the proximity to the Handlebar J Saloon and the faux-cowboys arriving in limos with 10-gallon hats. Then add a point back for the near-fight we got to watch between a biker and the faux-cowboy who almost hit him with his Cadillac.\n\nWe'll be back, and with more friends.", "type": "review", "business_id": "VSPuvNSDUvlTl670lVAkkw"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "nyhrEao5mLo8HdLPMRBKjw", "stars": 3, "date": "2012-07-06", "text": "4 stars for food, 2 stars for service.\n\nWent on a Tuesday night at 6:30 and we were the only ones there. Fine by me. One young man there, sitting at a table watching a Bollywood movie on the TV. No welcome, nothing. We sat down at a booth and he finally walked over. \"Would you like menus?\" \"Um, yes please\". He tried to direct us to the buffet, but we wanted to go ala carte. Back to his movie. When he brought our food, he set it on the table and walked away. \"Um, may we have some plates and utensils please\". \"Oh, sure\". The whole evening was like that. Just disinterested and aloof. Weird.\n\nFood was really good, though. Wonderful Kabli Chana (chick peas and potatoes in butter, masala, coriander & other spices. Dal (lentils in garam masala) was a little spicier than we asked for, but smoky, rich & delicious. Onion-stuffed naan and Saada rice were really good, too.\n\nSo, maybe we go back, but if we do, we take-out.", "type": "review", "business_id": "J1SyE2sa9WHPHm-aOSl3fg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "vP85J2jjGZF9CCUyySPpXw", "stars": 4, "date": "2013-02-09", "text": "Very solid all the way around. Food was interesting and tasty, service was just about perfect. Server recommended that we (three couples) share a bunch of small plates and entrees since it was our first time there. Works for me. Pork belly over white bean ragu was delightful. Octopus (which I usually don't eat) was also terrific. Farro salad (we had two vegetarians among us) was as good as I can imagine farro can be. A prosciutto and arugula pizza was super - thin, crispy, salty, fatty deliciousness. I passed on the other dishes, but everyone left full & happy. Servers and water were over frequently checking on us -- friendly without being intrusive. All good here.", "type": "review", "business_id": "U97cOaXPSOGmVhKEomPjlg"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "DMI0ZnITg5yCGNjQ8-pBWA", "stars": 5, "date": "2013-01-12", "text": "Everything I love and nothing I don't. Nice atmosphere -- cozy yet modern, very friendly. We got there a little early and sat at the bar. Nice selection of craft brews. San Tan Hop Shock IPA was wonderful. We started dinner with a (shared) bowl of the soup of the day; a delicious squash soup with duck confit. Oh, yes. My pork osso bucco was fall-off-the-bone-tender, the pickled cabbage and asparagus spears were a great complement, and they let me sub in corn spaetzle for the standard garlic mashed potatoes. Wifey enjoyed her squash ravioli, and our 4 friends loved their scallop and steak dishes. Shared two small plate desserts - a chocolate creme brulee and berry empanadas. Really good. Service was friendly and attentive. A perfect evening.", "type": "review", "business_id": "zj0BkAi54BGU_AK6AyvJDQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "TASKkRIW7993dRgIovV1FQ", "stars": 4, "date": "2013-08-08", "text": "First-time diner there. Solid place for lunch. Nice atmosphere inside and I could picture having a nice craft brew on the patio with family or friends. I ordered a burger -- 8 oz. of Kobe, cooked just as I asked, with bacon (mmmmm..bacon...), sauteed onions, basil & lettuce on a pretzel roll. Juicy, tasty, terrific. Should have ordered the 10 oz. version for another $1 more. Very large portion of mixed fries (1/2 reg., 1/2 sweet potato). My colleague had a big veggie burger that she enjoyed, and bowl of sweet potatoes and \"other stuff\" that was super delicious. Service was attentive and fun. I'll definitely be back. Maybe for \"breakfast for lunch\" -- the pancake menu (served til 4 p.m.) looked great.", "type": "review", "business_id": "qbEJeRvytnBo5BGG1R5kGg"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "JQr6X-VfdIl1ij6vEmZ9eA", "stars": 5, "date": "2013-01-17", "text": "Great stuff, right in my wheelhouse. 30-some craft brews (some local, many hard-to-find) up on a chalkboard. Start your \"quest for fun\". We were fortunate to get seated right away -- bustling and energetic on a Wednesday night. Friendly, attentive service. The chalkboard can be overwhelming, and our server tried to steer us in the direction of samplers, but my out-of-town buddy & I decided on a funky IPA for me and a local red ale for him. Excellent. Food is pretty much upscale bar food, and done well. Started with a plate of hot soft pretzels -- 4 crispy/soft/salty mini-loaves that hit the spot. On to a stoudt and a pale ale. I had a super grilled chicken sandwich on a fresh roll with bacon, BBQ sauce and fried onion strings. Loved it. His steak sandwich was just as good. One final porter for him and a water for me (I'm driving) and that was it.  We need more places like this in Phoenix.", "type": "review", "business_id": "41j3GB7M-Lwq284Pfb9zgw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "DDoKjPGK8c7_srOnUHRuRw", "stars": 2, "date": "2014-05-22", "text": "To paraphrase Woody Allen, \"Such bad food, and such small portions\".\n\nLike Chipotale/Qdobe/America's Taco Shop but not as good.\n\nThe good: Fresh tortillas\n\nThe bad: Everything else. \n\nService was bizarre. Weird combination of personalized, non-personalized and uncaring. I asked for my burrito as dry as possible and they made it sopping wet. Literally dripping out the tortilla in multiple places so I had to knife-and-fork it. Pork barbacoa was unique and sounded great but was not very good -- waaaay too sweet. Going down the service line, they asked me what kind of salsa I wanted (\"none, thanks\") and proceeded to dump a bunch of cheese inside my burrito without asking:\n \n\"Um, I'm sorry, but I didn't ask for cheese and can't have any\"\n\"We put cheese in every burrito\"\n\"You asked me what kind of menu item I wanted, what kind or rice, what kind of beans and what kind of meat, but you just put loads of cheese on everything without asking?\"\n*Rolls eyes and remakes burrito and begins to fold it*\n\"Excuse me, can I get lettuce in it?\"\n\"It goes in the oven, so we don't put it inside (places in oven), you get lettuce on the side\"\n\"But.......\"\n\nSo I can't have what I want or the way I want it. Got it.\n\nTo boot, a relatively small portion and about $1 more expensive than Chipotle/Qdoba, etc.\n\nNo thanks. I'll go anywhere else.", "type": "review", "business_id": "cQZcWeIDKEF-7nWU3gJMUw"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "COv4PYZSs3d8cFBjIf-xvA", "stars": 5, "date": "2013-03-08", "text": "Great pizza, wonderful beers, super service. What's not to like. Stopped in for a mid-afternoon lunch with wifey. Arrived before she did and scanned the menu for microbrews. Settled on a Green Flash IPA and ordered a pint. Server said, \"that's $5, but during pitchers are $5 during happy hour, so I'll bring you a pitcher\". SCORE.  Ordered a brussel sprouts, pancetta & manchego pizza to share. Amazing. Superb crust. Best touch was a touch of lemon juice on the pie, which provided just a hint of acid to cut the fat and saltiness of the cheese and pancetta. Server was really nice and fun. Tough to beat. We'll be back soon.", "type": "review", "business_id": "m9haUi2_1lHR2eAKBhKwDg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "9miAcNmWegwsvMOK-F21Lg", "stars": 4, "date": "2013-07-30", "text": "Nice find. I ordered the two-piece with waffle and \"upgraded\" to white meat. The fried chicken was as good as I've ever eaten. Big, hot & juicy pieces. A nice level of heat & spice without going overboard. The waffle was just kind of \"meh\". My father-in-law chowed down his chicken and enjoyed his fried okra and mashed potatoes. It's a fast-food set-up, but probably took 10-15 minutes to get our food on a Sunday at 6:15. No worries, I'll assume that's because they were cooking to order. Very sweet & polite register operator who was very patient while my 75 year-old FIL tried to understand and navigate the menu. Some typical fast-food mis-steps -- no plastic knives out on the floor to cut the waffle, had to go back ask for that. Forgot to hand me butter & syrup for the waffle, had to go back & ask for that. All in all, though, well done. I'll be back.", "type": "review", "business_id": "DnA5Ec7DOvaaCxmnLx2iYw"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "gO5dSuHzcrOjlG9cK-SXlw", "stars": 4, "date": "2013-07-08", "text": "Had been meaning to get here and finally made it last night. Excellent fare and solid service at reasonable prices. Party of 6 of us - man I love summer when the tourists leave and you can get seated right away anywhere. So nice to have craft beer on tap with my Mexican food - Four Peak Hop Knot IPA. Started with the chips and guac which I thought was very good, although I would have preferred it with the cheese on top. The elote, on the other hand, was wonderful -- as good as I've had. I ordered the \"paella\", which was a ittle thicker than a standard paella and seafood-less, I believe (Chicken, sausage, ham, root veggies). Very nice, and although I had plans to save some for tomorrow, it didn't happen. Wifey said the chicken mole was good, but she still prefers the version at Pepe's Taco Villa. OK, to each her own. Split an order of the coconut pudding (meh), and a key lime pie/tart/square/something that was phenomenal -- creamy and super-tart.\n\nOnly downside was that it was pretty warm in there. Don't know if they had A/C problems or were using a swamp cooler, but it was borderline uncomfortable at times. Crank up the A/C guys.\n\nGreat place. Great location. I'll be back to try the Al Pastor tacos, and can't wait to try the chicken soup everyone seems to be raving about...", "type": "review", "business_id": "rO3saNBRU2Pg16RyfEP6-g"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "p6yf60ZPd3bF1osh2eUPCQ", "stars": 3, "date": "2014-05-13", "text": "Quality grilled fish tacos. Very tasty, just a little pricey ($11.50 for two hefty ones). Had some nice beer choices. Vibe is nice. Service was spot-on -- guy at the register was very friendly and explained everything, brought out our food. Owner stopped over and spent some time with us. Still a little too \"fishy\" tasting for me -- next time I'd try chicken. I wished they had a fried fish version.", "type": "review", "business_id": "hNx3bcJT3pjw2hxbLhMy8g"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "3exdEvrgTDsG3HFcHU65pA", "stars": 4, "date": "2014-03-06", "text": "Nice array of upscale burgers & funky milkshakes, with a full bar loaded with local craft beers? Umm... yes, please. My daughter's favorite new joint. Went there last night with the extended family and a friend. My Goodnight burger was just as I ordered it, juicy & delicious, the bbq sauce and sauteed onions were a great blend. Helpful hint -- add bacon. Always. To everything. Fries were crisp, salty and lightly herbed. Family enjoyed their Lamb burger, Ahi Tuna \"burger\", Llano Poblano and entree salad (?). Four Peaks Hop Knot on draft or San Tan Hop Shock; both great. Solid service, lively atmosphere. A great all-around time.", "type": "review", "business_id": "z-vuSxK4jQvRBdsk4lFCAw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "1-XggXBb7wXJRV148-mIZw", "stars": 4, "date": "2013-10-14", "text": "Super good pizza from the folks who brought you CRUST. Sort of a Chipotle-like setup where you pick what you want on your pizza (crust, cheese, toppings). They cook it quickly, to order -- we went from ordering to eating in about 5-10 minutes. Nice open-air environment on a gorgeous Friday night. Bonus points for having San Tan Hop Knot IPA on draft. $4 for the first and 50% off for the 2nd. Service was just o.k., they \"lost\" our friends' orders, but eventually worked it out. Great place.", "type": "review", "business_id": "D7d-X4fLvVIdsCDFGpqzmg"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "bY-QkY9NLzAS0olwZ0ProQ", "stars": 3, "date": "2014-01-02", "text": "Went there for New Year's Eve dinner with two other couples. \n\nThe good: \n\nNice space & decor, great drinks and non-seafood dishes were surprisngly solid. A wonderful pork belly & fig appetizer. Chicken saltimbocca and purple mashed potato entree was delightful. Service was pretty good considering the full house and how recently they've opened.\n\nThe meh: \n\nSeafood dishes got mixed reviews. Fried cuttlefish appetizer was just so-so. Guys liked their monkfish over a bed of rice but the ladies said the crudo and cod dishes were nothing to write home about.\n\nPiano/vocal duo was pretty loud and not very good.\n\nNot great, not awful, but you'd expect more for the price. And if you're a seafood restaurant, the seafood really ought to be special.", "type": "review", "business_id": "Z9i5zrG_JN5fvKhNxQlQ0A"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "KbvQDYXfK6qI-WTEInIJuA", "stars": 4, "date": "2013-11-17", "text": "Got a flyer in the mail so I stopped in to check it out. Only been open for about a week, but they seemed to be running well. I'm more of a \"boutique\" pizza guy (Federal, il Bosco, Parlor), but Papa Murphy's is a great alternative for very good, quick, easy & affordable pizza nights. Picked up a large, thin crust pie with bacon (of course). They assemble it fresh, while you wait (about 5 minutes). I paid $7 with a coupon. Came with its own baking tray. Pop it in the oven for 12 minutes and you're good to go. Beats the poop out of the delivery chain pizzas -- uber-cheesy and tasty. Probably would have been even better if we owned a pizza stone. Hmmm... Owner seemed like a really good guy. We'll be back.", "type": "review", "business_id": "9wj2RkmuCHLG1pxy7-JXFA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "c8mfP6ozQXZo1A5-8dw_cw", "stars": 4, "date": "2013-12-29", "text": "Really good Middle Eastern fare in more of a white tablecloth environment. \n\nService was excellent -- charming and attentive hostess and server. It's a beautiful room/space, set up for \"energy\" (i.e. open and noisy -- with techno-ey music playing) rather than intimacy. Menu is interesting mix of middle eastern and Italian (clams and mussel dishes next to the babagnoush and kebabs). We started with an order of the falafel, which was really terrific. Comes with tahini but no pita (server: \"don't worry, I'll bring some out for you\"). Entrees are large portions. My kibbeh was really good; meaty, crunchy and loaded with spices. Wifey loved her moussaka. Beautiful bar. Nice that they had some craft-y beers (Four Peaks Kiltlifter, Anchor Steam) to go with the traditional nasty Bud/Miller/Coors.\n\nGood stuff.", "type": "review", "business_id": "VRKO86sUgxlXhVUurPwHBw"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "NcEg5kSmSN8jpPyy65QozQ", "stars": 4, "date": "2014-07-23", "text": "Good food, great salsas, great service. Pretty room, and friendly & attentive service. We were there for dinner (bonus -- happy hour runs through 7:00). Started off with chips and a variety of salsas. Loved the chipotle, as well as the avocado. Street tacos were $1.50 each so I tried all 4. Short rib, pork and chicken tacos were all very good. Octopus was only so-so; would have preferred more grill/char flavor. Decent craft beer options, although no drafts and high priced ($5?) for \"happy hour\". Nice place, we'll be back.", "type": "review", "business_id": "ozgJsYVsskxn3n9HMqqMdw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "dXz3hDpvFHKUoiTeV25DRA", "stars": 4, "date": "2014-09-22", "text": "Well worth 4 stars -- 5 star food. 3 star prices & speed. I loved Tacos Atoyac so I was really looking forward to this.\n\nThe Good - tacos & burritos were outstanding, brisket with caramelized onions & clementine, al pastor and turkey mole were all amazing. Kudos for having wonderful spicy pickled carrots at the salsa bar. YUM!\n\nThe Not So Good - At about $3 per street taco (2-3x the price of Tacos Atoyac) it's a bit overpriced. Won't stop me from returning, though. Also a bit slow (20 minutes or so between ordering & receiving), but I'll assume they're still working out the opening kinks.\n\nLooking forward to going back.", "type": "review", "business_id": "uuz88xYUWYFn6j0SJCVcTg"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "s5Zc0Fw5Rg26r4Xg3RULrw", "stars": 4, "date": "2014-12-06", "text": "Alex (our server) -- Thank you for taking a bad situation and turning it around. You are a great example of how you can save a poorly-executed meal with good service.\n\nWe had a party of 10. Pre-dinner drinks were wonderful -- great mojitos, margaritas, tequilas and IPAs. Appetizers come out quickly, and tasty. Good stuff, especially the ceviches and the guac.\n\nMeals came out all at once. Not sure how it happened, but 1 of them came out room temparature and 4 of them came out cold, including a steak that was extremely rare (red bordering on purple inside). Alex apologized profusely and was able to get the dishes fixed and/or refired, but it took quite a while, so we weren't eating at the same time. He spent a lot of time apologizing and trying to make it right. He brought the GM out, comped 4 of our entrees, and comped us some desserts.\n\nThe food itself was terrific. Duck breast mole was wonderful, as was the seafood stew, the short rib enchiladas, the achiote-roasted pork. Everyone enjoyed the meal, just not the process.\n\nNot sure why food came out cold. Place was only 1/3 full, although there was a big private party in the back. Maybe the kitchen just got hammered or lost their focus.\n\nSo 5 stars for service, 4.5 stars for food and 1 star for the kitchen.", "type": "review", "business_id": "FvDa81O48IZx_LhjSiv_bQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "rqq-DWLEPxbfl_LvxZx_jw", "stars": 5, "date": "2014-12-30", "text": "Amazing. Went in with another family (9 of us) for a quick breakfast get-together. Got a dozen to share (cut them into quarters) and then ended up ordering another 2 that not everyone got to sample. Wonderful flavor combinations. Standouts were the Key Lime, Blueberry Cheesecake, Apple Fritter and the Lemon Poppyseed. But the Chocolate-Pudding-Filled-Red-Wine-Glazed-With-Pinot-Noir-Salt was INSANELY AWESOME. Service was super friendly. Can't wait to come back during lunch hours and try the fried chicken, which smelled phenomenal.", "type": "review", "business_id": "UimUu5Q1m2mYEmAvreZQig"}
